cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<vendor>Maxim Integrated</vendor>
	
	<vendorID>Maxim</vendorID>
	<name>MAX32550</name>
	<version>1.0</version>
	<description>32-bit ARM Cortex-M3 microcontroller, 1MB of flash, 256KB of system RAM, 4KB of One-Time-Programmable (OTP) memory, 64KB of Boot ROM, 8KB of battery-backed and AES self-encrypted SRAM.</description>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<peripherals>
		<peripheral>
			<name>GlobalControl</name>
			<description>Registers controlling global functions</description>
			<baseAddress>0x40000000</baseAddress>
			<registers>
				<register>
					<name>SCON</name>
					<description>System Control</description>
					<addressOffset>0x00</addressOffset>
					<resetMask>0xFFFFFFFE</resetMask>
					<fields>
						<field>
							<name>BSTAPEN</name>
							<description>Boundary Scan TAP enable. When enabled, the JTAG port is connected to the Boundary Scan TAP. Otherwise, the port is connected to the ARM ICE function. This bit is reset by the POR. Reset value and access depend on the part number.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ONVMAIN</name>
							<description>Battery supply source flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>batt_supply_enum</name>
								<enumeratedValue>
									<name>vBat</name>
									<description>VBAT is selected to supply battery supply.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>vMain</name>
									<description>VMAIN is selected to supply battery supply.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FLASH_PAGE_FLIP</name>
							<description>Flips the Flash bottom and top halves. (Depending on the total flash size, each half is either 256K or 512K). Initiating a flash page flip will cause a flush of both the data buffer on the DCODE bus and the internal instruction buffer.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>flash_flip_enum</name>
								<enumeratedValue>
									<name>normal</name>
									<description>Physical layout matches logical layout.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>swapped</name>
									<description>Bottom half mapped to logical top half and vice versa.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCHK</name>
							<description>Compute ROM Checksum. This bit is self-cleared when calculation is completed. Once set, software clearing this bit is ignored and the bit will remain set until the operation is completed.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHKRD</name>
							<description>ROM Checksum Ready. This bit is self-cleared when a new checksum calculation is started (CCHK is set).</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<enumeratedValues>
								<name>op_status_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<description>Result not ready</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<description>Operation complete and result ready</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHKRES</name>
							<description>ROM Checksum Result. This bit is only valid when CHKRD=1.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<enumeratedValues>
								<name>pass_fail_enum</name>
								<enumeratedValue>
									<name>pass</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fail</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTR</name>
					<description>Reset</description>
					<addressOffset>0x04</addressOffset>
					<fields>
						<field>
							<name>DMA</name>
							<description>DMA Reset</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>reset_write_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<description>Starts reset operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							<enumeratedValues>
								<name>reset_read_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>reset</name>
									<description>Reset complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<description>Reset in progress</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DMA">
							<name>WDT</name>
							<description>Watchdog Timer Reset</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="DMA">
							<name>GPIO0</name>
							<description>GPIO0 Reset. Setting this bit to 1 resets GPIO0 pins to their default states.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="DMA">
							<name>GPIO1</name>
							<description>GPIO1 Reset. Setting this bit to 1 resets GPIO1 pins to their default states.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="DMA">
							<name>GPIO2</name>
							<description>GPIO2 Reset. Setting this bit to 1 resets GPIO2 pins to their default states.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER0</name>
							<description>Timer0 Reset. Setting this bit to 1 resets Timer 0 blocks.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER1</name>
							<description>Timer1 Reset. Setting this bit to 1 resets Timer 1 blocks.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER2</name>
							<description>Timer2 Reset. Setting this bit to 1 resets Timer 2 blocks.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER3</name>
							<description>Timer3 Reset. Setting this bit to 1 resets Timer 3 blocks.</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER4</name>
							<description>Timer4 Reset. Setting this bit to 1 resets Timer 4 blocks.</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TIMER5</name>
							<description>Timer5 Reset. Setting this bit to 1 resets Timer 5 blocks.</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="DMA">
							<name>UART0</name>
							<description>UART0 Reset. Setting this bit to 1 resets all UART 0 blocks.</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SPI0</name>
							<description>SPI0 Reset. Setting this bit to 1 resets all SPI 0 blocks.</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SPI1</name>
							<description>SPI1 Reset. Setting this bit to 1 resets all SPI 1 blocks.</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SPI2</name>
							<description>SPI2 Reset. Setting this bit to 1 resets all SPI 2 blocks.</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="DMA">
							<name>I2C</name>
							<description>I2C Reset</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="DMA">
							<name>RTC</name>
							<description>Real Time Clock Reset</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="DMA">
							<name>CRYPTO</name>
							<description>Cryptographic Reset. Setting this bit to 1 resets the AES block, the SHA block and the DES block.</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="DMA">
							<name>MAGDSP</name>
							<description>Magnetic Strip Reader Reset</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SC</name>
							<description>Smart Card Reader Reset</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="DMA">
							<name>KBD</name>
							<description>Secure Keypad Reset</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="DMA">
							<name>TFT_LCD</name>
							<description>TFT/LCD Reset. Setting this bit to 1 resets both the TFT and mono LCD blocks.</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="DMA">
							<name>USB</name>
							<description>USB Reset. Setting this bit resets both USB blocks.</description>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="DMA">
							<name>ADC</name>
							<description>Analog to Digital Reset</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="DMA">
							<name>DAC</name>
							<description>Digital to Analog Reset</description>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SRST</name>
							<description>Soft Reset. Setting this bit to 1 resets everything except the CPU and the watchdog timer.</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="DMA">
							<name>PRST</name>
							<description>Peripheral Reset. Setting this bit to 1 resets all peripherals. The CPU core, the watchdog timer, and all GPIO pins are unaffected by this reset.</description>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="DMA">
							<name>SYSTEM</name>
							<description>System Reset. Setting this bit to 1 resets the CPU core and all peripherals, including the watchdog timer.</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCN</name>
					<description>Clock Control</description>
					<addressOffset>0x08</addressOffset>
					<resetValue>0x00000008</resetValue>
					<fields>
						<field>
							<name>PSC</name>
							<description>Prescaler Select. This 3 bit field sets the system operating frequency by controlling the prescaler that divides the output of the PLL0.</description>
							<lsb>6</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>clk_div_enum</name>
								<enumeratedValue>
									<name>div1</name>
									<description>Divide by 1</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div2</name>
									<description>Divide by 2</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div4</name>
									<description>Divide by 4</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div8</name>
									<description>Divide by 8</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div16</name>
									<description>Divide by 16</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div32</name>
									<description>Divide by 32</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div64</name>
									<description>Divide by 64</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div128</name>
									<description>Divide by 128</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Clock Source Select. This 3 bit field selects the source for the system clock.</description>
							<lsb>9</lsb>
							<msb>11</msb>
							<enumeratedValues>
								<name>clk_sel_enum</name>
								<enumeratedValue>
									<name>cryptoOsc</name>
									<description>Crypto oscillator is used for the system clock.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pllOutput</name>
									<description>The PLL output is used for the system clock.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hfxIn</name>
									<description>HFXIN is used for the system clock.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>nanoRing</name>
									<description>The nano-ring output is used for the system clock.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CKRDY</name>
							<description>Clock Ready. This read only bit reflects whether the currently selected system clock source is running.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>op_status_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<description>Result not ready</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<description>Operation complete and result ready</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PM</name>
					<description>Power Management</description><addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>MODE</name>
							<description>Operating Mode. This two bit field selects the current operating mode for the device. Note that code execution only occurs during ACTIVE mode.</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>op_mode_enum</name>
								<enumeratedValue>
									<name>active</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>idle</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>standby</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>shutdown</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPIOWKEN</name>
							<description>GPIO Wake Up Enable. This bit enables all GPIO pins as potential wakeup sources. Any GPIO configured for wakeup is capable of causing an exit from IDLE or STANDBY modes when this bit is set.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="GPIOWKEN">
							<name>RTCWKEN</name>
							<description>RTC Alarm Wake Up Enable. This bit enables RTC alarm as wakeup source. If enabled, the desired RTC alarm must be configured via the RTC control registers.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="GPIOWKEN">
							<name>USBWKEN</name>
							<description>USB Wake Up Enable. This bit enables USB activity as wakeup source.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="GPIOWKEN">
							<name>SCWKEN</name>
							<description>Smart Card Wake Up Enable. This bit enables Smart Card activity as a wakeup source.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="GPIOWKEN">
							<name>OSCPD</name>
							<description>External Oscillator Power Down. Setting this bit prior to entering the STANDBY mode, powers down the External Oscillator circuit.</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field>
							<name>PLL01PD</name>
							<description>PLL0/1 Power Down. This bit selects PLL power state in STANDBY mode.</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<enumeratedValues>
								<name>powered_enum</name>
								<enumeratedValue>
									<name>active</name>
									<description>In active mode</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>standBy</name>
									<description>In standby mode</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="PLL01PD">
							<name>COPD</name>
							<description>Crypto Oscillator Power Down. This bit selects crypto oscillator power state in STANDBY mode.</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="GPIOWKEN">
							<name>CM3PMUEN</name>
							<description>CM3 Power Management Enable.  Setting this bit will allow the CM3_DEEPSLEEP or CM3_SLEEPING state to put the device into STANDBY mode.</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field>
							<name>CM3WICACK</name>
							<description>CM3 WIC Acknowledge.  This status bit reflects the state of the CM3 WIC acknowledge to PMU request.</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>PLL%sCN</name>
					<description>PLL Control</description>
					<addressOffset>0x10</addressOffset>
					<fields>
						<field>
							<name>PLLxEN</name>
							<description>PLL Enable. This bit enables system PLL for clock multiplication.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLxLOCK</name>
							<description>PLL Lock. This bit is set by hardware when the PLL is locked to the input clock. It is cleared when the PLL is disabled, lock is not yet achieved or when the lock is lost.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>locked_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>unlocked</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PCKDIV</name>
					<description>Peripheral Clock Divider</description>
					<addressOffset>0x18</addressOffset>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>PCF</name>
							<description>These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware. These bits determine the clock frequency for the UART, I2C and Key Pad peripherals. These peripherals have an adaptive clock generator that dynamically adjusts the peripheral frequency based on the main system bus frequency. These bits are dynamically updated when the PLL0 is selected as the system clock source and are set by hardware.</description>
							<lsb>0</lsb>
							<msb>2</msb>
						</field>
					</fields>
				</register>
