cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register>
					<name>PERCKCN</name>
					<description>Peripheral Clock Disable</description>
					<addressOffset>0x24</addressOffset>
					<fields>
						<field>
							<name>GPIO0D</name>
							<description>GPIO0 Disable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>en_dis_enum</name>
								<enumeratedValue>
									<name>enable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>disable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="GPIO0D">
							<name>GPIO1D</name>
							<description>GPIO1 Disable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>GPIO2D</name>
							<description>GPIO2 Disable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>USBD</name>
							<description>USB Disable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>CLCDD</name>
							<description>Color LCD Controller Disable</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>DMAD</name>
							<description>DMA Disable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>SPI0D</name>
							<description>SPI 0 Disable</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>SPI1D</name>
							<description>SPI 1 Disable</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>SPI2D</name>
							<description>SPI 2 Disable</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>UART0D</name>
							<description>UART 0 Disable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>UART1D</name>
							<description>UART 1 Disable</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>MAGDSPD</name>
							<description>Magnetic Stripe DSP Disable</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>SCD</name>
							<description>Smart Card Disable</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>I2CD</name>
							<description>I2C Disable</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>CRYPTOD</name>
							<description>Crypto Disable</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T0D</name>
							<description>Timer 0 Disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T1D</name>
							<description>Timer 1 Disable</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T2D</name>
							<description>Timer 2 Disable</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T3D</name>
							<description>Timer 3 Disable</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T4D</name>
							<description>Timer 4 Disable</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>T5D</name>
							<description>Timer 5 Disable</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>MLCDD</name>
							<description>Mono LCD Disable</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>KBDD</name>
							<description>Keypad Disable</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>ADCC</name>
							<description>ADC Disable</description>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="GPIO0D">
							<name>DACD</name>
							<description>DAC Disable</description>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMZCN</name>
					<description>Memory Zeroize Control</description><addressOffset>0x2C</addressOffset>
					<fields>
						<field>
							<name>SRAM0</name>
							<description>System RAM Block 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>nop</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SRAM0">
							<name>SRAM1</name>
							<description>System RAM Block 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="SRAM0">
							<name>ICACHE</name>
							<description>Instruction Cache</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="SRAM0">
							<name>CRYPTO</name>
							<description>Crypto (MAA) Memory</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>SCCK</name>
					<description>Smart Card Clock Control</description><addressOffset>0x34</addressOffset>
					<resetValue>0x00000014</resetValue>
					<fields>
						<field>
							<name>SC0FRQ</name>
							<description>Smart Card 0 Clock Frequency.  These bits  define Smart Card 0 clock frequency.  f_SC0 = f_PLL1 / SC0FRQ</description>
							<lsb>0</lsb>
							<msb>5</msb>
						</field>
					</fields>
				</register>
