cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>SystemInitialization</name>
			<description>System Initialization Registers</description>
			<baseAddress>0x40000400</baseAddress>
			<registers>
				<register>
					<name>SISTAT</name>
					<description>System Initialization Status Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>MAGIC</name>
							<description>Magic Word Validation.  This bit is set by the system initialization block following power-up.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>magic_valid_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>magicNotSet</name>
									<description>Magic word was not set (OTP has not been initialized properly).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>magicSet</name>
									<description>Magic word was set (OTP contains valid settings).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CRCERR</name>
							<description>CRC Error Status.  This bit is set by the system initialization block following power-up.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>error_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>noError</name>
									<description>No CRC errors occurred during the read of the OTP memory block.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error</name>
									<description>A CRC error occurred while reading the OTP. The address of the failure location in the OTP memory is stored in the ERRADDR register.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR</name>
					<description>Read-only field set by the SIB block if a CRC error occurs during the read of the OTP memory. Contains the failing address in OTP memory (when CRCERR equals 1).</description>
					<addressOffset>0x04</addressOffset>
				</register>
			</registers>
			<access>read-only</access>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>InstructionCacheController</name>
			<description>Registers to control the instruction cache</description>
			<baseAddress>0x4002A000</baseAddress>
			<registers>
				<register>
					<name>CACHE_ID</name>
					<description>Cache ID Register</description>
					<addressOffset>0x0000</addressOffset>
					<access>read-only</access>
					<fields>
						<field>
							<name>RELNUM</name>
							<description>Release Number. Identifies the RTL release version.</description>
							<lsb>0</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>PARTNUM</name>
							<description>Part Number. This field reflects the value of C_ID_PART_NUMBER configuration parameter.</description>
							<lsb>6</lsb>
							<msb>9</msb>
						</field>
						<field>
							<name>CCHID</name>
							<description>Cache ID. This field reflects the value of the C_ID_CACHEID configuration parameter.</description>
							<lsb>10</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>MEMCFG</name>
					<description>Memory Configuration Register</description>
					<addressOffset>0x0004</addressOffset>
					<access>read-only</access>
					<resetValue>0x00080008</resetValue>
					<fields>
						<field>
							<name>CCHSZ</name>
							<description>Cache Size. Indicates total size in Kbytes of cache.</description>
							<lsb>0</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>MEMSZ</name>
							<description>Main Memory Size. Indicates the total size, in units of 128 Kbytes, of code memory accessible to the cache controller.</description>
							<lsb>16</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>CACHE_CTRL</name>
					<description>Cache Control and Status Register</description>
					<addressOffset>0x0100</addressOffset>
					<fields>
						<field>
							<name>CACHE_EN</name>
							<description>Cache Enable. Controls whether the cache is bypassed or is in use. Changing the state of this bit will cause the instruction cache to be flushed and its contents invalidated.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<description>Cache Bypassed. Instruction data is stored in the line fill buffer but is not written to main cache memory array.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<description>Cache Enabled</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CACHE_RDY</name>
							<description>Cache Ready flag. Cleared by hardware when at any time the cache as a whole is invalidated (including a system reset). When this bit is 0, the cache is effectively in bypass mode (instruction fetches will come from main memory or from the line fill buffer). Set by hardware when the invalidate operation is complete and the cache is ready.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>ready_enum</name>
								<enumeratedValue>
									<name>notReady</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INVALIDATE</name>
					<description>Invalidate All Registers</description>
					<addressOffset>0x0700</addressOffset>
				</register>
