cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>GPIO_0</name>
			<description>Individual I/O for Port 0</description>
			<prependToName>GPIO0_</prependToName>
			<baseAddress>0x40008000</baseAddress>
			<interrupt><name>GPIO0</name><value>24</value></interrupt>
			<registers>
				<register>
					<name>EN</name>
					<description>GPIO Function Enable Register. Each bit controls the GPIO_EN setting for one GPIO pin on the associated port.</description>
					<addressOffset>0x00</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register derivedFrom="EN">
					<name>OUT_EN</name>
					<description>GPIO Output Enable Register. Each bit controls the GPIO_OUT_EN setting for one GPIO pin in the associated port.</description>
					<addressOffset>0x0C</addressOffset>
					<resetValue>0x00000000</resetValue>
				</register>
				<register>
					<name>OUT</name>
					<description>GPIO Output Register. Each bit controls the GPIO_OUT setting for one pin in the associated port.  This register can be written either directly, or by using the GPIO_OUT_SET and GPIO_OUT_CLR registers.</description>
					<addressOffset>0x18</addressOffset>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>lo</name>
									<description>Logic 0 (low)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Logic 1 (high)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT_SET</name>
					<description>GPIO Output Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_OUT to 1, without affecting other bits in that register.</description>
					<addressOffset>0x1C</addressOffset>
					<access>write-only</access>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>set_enum</name>
								<enumeratedValue>
									<name>nop</name>
									<description>No effect</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>set</name>
									<description>Set bit in this position</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT_CLR</name>
					<description>GPIO Output Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_OUT to 0, without affecting other bits in that register.</description>
					<addressOffset>0x20</addressOffset>
					<access>write-only</access>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>clr_enum</name>
								<enumeratedValue>
									<name>nop</name>
									<description>No effect</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>Clear bit in this position</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
