cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register derivedFrom="OUT">
					<name>IN</name>
					<description>GPIO Input Register. Read-only register to read from the logic states of the GPIO pins on this port.</description>
					<addressOffset>0x24</addressOffset>
					<access>read-only</access>
				</register>
				<register>
					<name>INT_MOD</name>
					<description>GPIO Interrupt Mode Register. Each bit in this register controls the interrupt mode setting for the associated GPIO pin on this port.</description>
					<addressOffset>0x28</addressOffset>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>int_mode_enum</name>
								<enumeratedValue>
									<name>level</name>
									<description>Interrupts for this pin are level triggered.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>edge</name>
									<description>Interrupts for this pin are edge triggered.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>INT_POL</name>
					<description>GPIO Interrupt Polarity Register. Each bit in this register controls the interrupt polarity setting for one GPIO pin in the associated port.</description>
					<addressOffset>0x2C</addressOffset>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>int_pol_enum</name>
								<enumeratedValue>
									<name>lo</name>
									<description>Interrupts are latched on a falling edge or low level condition for this pin.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Interrupts are latched on a rising edge or high level condition for this pin.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
