cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register derivedFrom="OUT_EN">
					<name>INT_EN</name>
					<description>GPIO Interrupt Enable Register. Each bit in this register controls the GPIO interrupt enable for the associated pin on the GPIO port.</description>
					<addressOffset>0x34</addressOffset>
				</register>
				<register derivedFrom="OUT_SET">
					<name>INT_EN_SET</name>
					<description>GPIO Interrupt Enable Set. Writing a 1 to one or more bits in this register sets the bits in the same positions in GPIO_INT_EN to 1, without affecting other bits in that register.</description>
					<addressOffset>0x38</addressOffset>
				</register>
				<register derivedFrom="OUT_CLR">
					<name>INT_EN_CLR</name>
					<description>GPIO Interrupt Enable Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_INT_EN to 0, without affecting other bits in that register.</description>
					<addressOffset>0x3C</addressOffset>
				</register>
				<register>
					<name>INT_STAT</name>
					<description>GPIO Interrupt Status Register. Each bit in this register contains the pending interrupt status for the associated GPIO pin in this port.</description>
					<addressOffset>0x40</addressOffset>
					<access>read-only</access>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register derivedFrom="OUT_CLR">
					<name>INT_CLR</name>
					<description>GPIO Interrupt Status Clear. Writing a 1 to one or more bits in this register clears the bits in the same positions in GPIO_INT_STAT to 0, without affecting other bits in that register.</description>
					<addressOffset>0x48</addressOffset>
				</register>
				<register derivedFrom="OUT_EN">
					<name>WAKE_EN</name>
					<description>GPIO Wake Enable Register. Each bit in this register controls the PMU wakeup enable for the associated GPIO pin in this port.</description>
					<addressOffset>0x4C</addressOffset>
				</register>
