cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register derivedFrom="OUT_EN">
					<name>INT_DUAL_EDGE</name>
					<description>GPIO Interrupt Dual Edge Mode Register. Each bit in this register selects dual edge mode for the associated GPIO pin in this port.</description>
					<addressOffset>0x5C</addressOffset>
				</register>
				<register derivedFrom="OUT_EN">
					<name>PAD_CFG1</name>
					<description>GPIO Input Mode Config 1. Each bit in this register enables the weak pull-up for the associated GPIO pin in this port.</description>
					<addressOffset>0x60</addressOffset>
				</register>
				<register derivedFrom="OUT_EN">
					<name>PAD_CFG2</name>
					<description>GPIO Input Mode Config 2. Each bit in this register enables the weak pull-down for the associated GPIO pin in this port.</description>
					<addressOffset>0x64</addressOffset>
				</register>
				<register>
					<name>EN1</name>
					<description>GPIO Alternate Function Enable Register. Each bit in this register selects between primary/secondary functions for the associated GPIO pin in this port.</description>
					<addressOffset>0x68</addressOffset>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>pri_sec_enum</name>
								<enumeratedValue>
									<name>primary</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>secondary</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>DS</name>
					<description>GPIO Drive Strength Register. Each bit in this register selects the drive strength for the associated GPIO pin in this port. Refer to the Datasheet for sink/source current of GPIO pins in each mode.</description>
					<addressOffset>0xB0</addressOffset>
					<fields>
						<field>
							<name>BIT0</name>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>drive_enum</name>
								<enumeratedValue>
									<name>loDrive</name>
									<description>GPIO port pin is in low-drive mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hiDrive</name>
									<description>GPIO port pin is in high-drive mode.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT1</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT2</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT3</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT4</name>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT5</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT6</name>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT7</name>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT8</name>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT9</name>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT10</name>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT11</name>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT12</name>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT13</name>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT14</name>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT15</name>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT16</name>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT17</name>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT18</name>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT19</name>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT20</name>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT21</name>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT22</name>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT23</name>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT24</name>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT25</name>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT26</name>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT27</name>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT28</name>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT29</name>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT30</name>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="BIT0">
							<name>BIT31</name>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
