cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="GPIO_0">
			<name>GPIO_1</name>
			<description>Individual I/O for Port 1</description>
			<prependToName>GPIO1_</prependToName>
			<baseAddress>0x40009000</baseAddress>
			<interrupt><name>GPIO1</name><value>25</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="GPIO_0">
			<name>GPIO_2</name>
			<description>Individual I/O for Port 2</description>
			<prependToName>GPIO2_</prependToName>
			<baseAddress>0x4000A000</baseAddress>
			<interrupt><name>GPIO2</name><value>26</value></interrupt>
		</peripheral>
		<peripheral>
			<name>ADC</name>
			<description>Analog to Digital Converter</description>
			<prependToName>ADC_</prependToName>
			<baseAddress>0x40034000</baseAddress>
			<interrupt><name>ADC</name><value>20</value></interrupt>
			<registers>
				<register>
					<name>CN</name>
					<description>ADC Control Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>ADEN</name>
							<description>ADC Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ADEN">
							<name>ADDAIE</name>
							<description>ADC Data Available Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field>
							<name>ADALGN</name>
							<description>ADC Data Alignment Select. This bit selects the ADC data alignment mode.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>align_enum</name>
								<enumeratedValue>
									<name>rightAlign</name>
									<description>ADC data is in right alignment format in ADDDATA[9:0] while ADDATA[15:10] is filled with zero.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>leftAlign</name>
									<description>ADC data is in left alignment format in ADDDATA[15:6] while ADDATA[5:0] is filled with zero.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADCH</name>
							<description>ADC Input Channel Select.  These bits select the input channel to the ADC converter.</description>
							<lsb>3</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>adc_ch_enum</name>
								<enumeratedValue>
									<name>an0</name>
									<description>AN0</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>an1</name>
									<description>AN1</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>tempSensor</name>
									<description>Internal Temp Sensor</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ADEN">
							<name>ADSCL</name>
							<description>ADC Input Scale.  This bit selects the scale factor applies to AN0 and AN1 inputs when using the internal reference. Note that the ADSCL setting is ignored when AVDD is selected as the reference. Note that the ADSCL setting is ignored when AVDD is selected as the reference. ADC Input Scale.  This bit selects the scale factor applies to AN0 and AN1 inputs when using the internal reference.  Note that the ADSCL setting is ignored when AVDD is selected as the reference. ADC Input Scale.  This bit enabled the 1/3 scale factor applied to AN0 and AN1 inputs when using the internal reference. Note that the ADSCL setting is ignored when AVDD is selected as the reference.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>ADREF</name>
							<description>ADC Reference Select.  This bit selects the reference voltage used in the ADC conversion.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>adc_ref_enum</name>
								<enumeratedValue>
									<name>avdd</name>
									<description>AVDD</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>internalRef</name>
									<description>Internal Reference</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ADREF">
							<name>IREFIN</name>
							<description>Internal Reference Enable.  This bit has the same value as ADREF.  This bit is read only.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADCCLK</name>
							<description>ADC Clock Divider.  These bits select the ADC conversion clock in relationship to the APB Clock. The APB is first passed through a divide by 16 prescaler and passed to programmable divider so that ADC clock would be in the range of 8MHz with APB clock frequency of 100MHz.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<enumeratedValues>
								<name>adc_clk_enum</name>
								<enumeratedValue>
									<name>div16</name>
									<description>PCLK / 16</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div32</name>
									<description>PCLK / 32</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div64</name>
									<description>PCLK / 64</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div128</name>
									<description>PCLK / 128</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ADEN">
							<name>ADLTIE</name>
							<description>ADC Low Threshold Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="ADEN">
							<name>ADHTIE</name>
							<description>ADC High Threshold Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="ADEN">
							<name>TSEN</name>
							<description>Temp Sensor Enable.  This bit enables the internal temp sensor available when ADC_CN.ADCH = b11.</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field>
							<name>ADOVFDIS</name>
							<description>Overflow Disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<enumeratedValues>
								<name>en_dis_enum</name>
								<enumeratedValue>
									<name>enable</name>
									<description>ADST.ADOVF bit will be set when the ADC overflows. In this case ADDATA will return a data of 0x3FF if an overflow occurs.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>disable</name>
									<description>ADST.ADOVF bit will not be set when an overflow occurs. In this case ADDATA will return the overflowed data.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ST</name>
					<description>ADC Status Register</description>
					<addressOffset>0x04</addressOffset>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>ADCONV</name>
							<description>ADC Start Conversion. Note that since this bit is not cleared on entry to STOP mode, it is up to the user software to clear ADCONV before entering STOP mode. If this bit is not cleared, the ADC will be held in its current state during STOP mode, and will resume operation at the point where it left off when STOP mode is exited. To avoid undesirable current draw by this block it is recommended to clear this bit prior to entering the STOP mode.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>start_conv_enum</name>
								<enumeratedValue>
									<name>stop</name>
									<description>Stop ADC conversion. The ADC will stop acquiring data immediately.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Starts an ADC conversion when the ADC is enabled (ADEN=1).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADDAI</name>
							<description>ADC Data Available Interrupt Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>Flag asserted</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ADDAI">
							<name>ADOVF</name>
							<description>ADC Overflow Flag. Once set this bit will remain set unless cleared by software.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>ADLTIF</name>
							<description>ADC Low Threshold Interrupt Flag. Setting this bit to 1 by software will generate an interrupt if enabled.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="ADDAI">
							<name>ADHTIF</name>
							<description>ADC High Threshold Interrupt Flag. Setting this bit to 1 by software will generate an interrupt if enabled.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>ADC Data Register. When read, this register returns the ADC conversion data. The ADC conversion result will be aligned according to the ADALGN setting.</description>
					<addressOffset>0x08</addressOffset>
					<size>16</size>
					<access>read-only</access>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x04</dimIncrement>
					<name>LT%s</name>
					<description>ADC channel Low Threshold Value. When an ADC conversion result of channel is less than ADC Low Threshold value (ADLT), ADLTIF flag will be set.</description>
					<addressOffset>0x0C</addressOffset>
					<size>10</size>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>0x04</dimIncrement>
					<name>HT%s</name>
					<description>ADC channel High Threshold Value. When an ADC conversion result of channel is greater than ADC High Threshold value (ADHT), ADHTIF flag will be set.</description>
					<addressOffset>0x18</addressOffset>
					<size>10</size>
				</register>
