cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>CryptographicAccelerator</name>
			<description>The cryptographic accelerator used to assist the computationally intensive operations of several common algorithms.</description>
			<baseAddress>0x40001000</baseAddress>
			<interrupt><name>Crypto_Engine</name><value>27</value></interrupt>
			<registers>
				<register>
					<name>CRYPTO_CTRL</name>
					<description>Crypto Control Register</description>
					<addressOffset>0x00</addressOffset>
					<resetValue>0xC0000000</resetValue>
					<fields>
						<field>
							<name>RST</name>
							<description>Reset. This bit is used to reset the crypto accelerator.  All crypto internal states and related registers are reset to their default reset values. Control register such as CRYPTO_CTRL, CIPHER_CTRL, HASH_CTRL, CRC_CTRL, MAA_CTRL (with the exception of the STC bit), HASH_MSG_SZ_[3:0] and MAA_MAWS will retain their values. This bit will automatically clear itself after one cycle.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>reset_write_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<description>Starts reset operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							<enumeratedValues>
								<name>reset_read_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>reset</name>
									<description>Reset complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<description>Reset in progress</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INT</name>
							<description>Interrupt Enable. Generates an interrupt when done or error set.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC</name>
							<description>Source Select.  This bit selects the hash function and CRC generator input source.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>src_sel_enum</name>
								<enumeratedValue>
									<name>inputFIFO</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>outputFIFO</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="INT">
							<name>BSO</name>
							<description>Byte Swap Output. Note. No byte swap will occur if there is not a full word.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="INT">
							<name>BSI</name>
							<description>Byte Swap Input. Note. No byte swap will occur if there is not a full word.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="INT">
							<name>WAIT_EN</name>
							<description>Wait Pin Enable. This can be used to hold off the crypto DMA until an external memory is ready. This is useful for transferring pages from NAND flash which may take several microseconds to become ready.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field>
							<name>WAIT_POL</name>
							<description>Wait Pin Polarity. When the wait pin is enabled, this bit selects its active state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>pol_enum</name>
								<enumeratedValue>
									<name>activeLo</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeHi</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRSRC</name>
							<description>Write FIFO Source Select. This field determines where data written to the write FIFO comes from. When data is written to the write FIFO, it is always written out the DMA. To decrypt or encrypt data, the write FIFO source should be set to the cipher output. To implement memcpy() or memset() functions, or to fill memory with random data, the write FIFO source should be set to the read FIFO. When calculating a HASH or CMAC, the write FIFO should be disabled.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<enumeratedValues>
								<name>wr_fifo_src_enum</name>
								<enumeratedValue>
									<name>none</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>cipherOutput</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>readFIFO</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDSRC</name>
							<description>Read FIFO Source Select. This field selects the source of the read FIFO. Typically, it is set to use the DMA. To implement a memset() function, the read FIFO DMA should be disabled. To fill memory with random data or to hash random numbers, the read FIFO source should be set to the random number generator.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<enumeratedValues>
								<name>rd_fifo_sel_enum</name>
								<enumeratedValue>
									<name>dmaDisabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>dmaOrApb</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RNG</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DMA_DONE</name>
							<description>DMA Done. DMA write/read operation is complete. This bit must be cleared before starting a DMA operation.</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<enumeratedValues>
								<name>op_done_enum</name>
								<enumeratedValue>
									<name>notDone</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>done</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DMA_DONE">
							<name>GLS_DONE</name>
							<description>Galois Done. FIFO is full and CRC or Hamming Code Generator is enabled. This bit must be cleared before starting a CRC operation Note that DMA_DONE must be polled instead of this bit to determine the end of DMA operation during the utilization of Hamming Code Generator.</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="DMA_DONE">
							<name>HSH_DONE</name>
							<description>Hash Done. SHA operation is complete. This bit must be cleared before starting a HASH operation.</description>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="DMA_DONE">
							<name>CPH_DONE</name>
							<description>Cipher Done. Either AES or DES encryption/decryption operation is complete. This bit must be cleared before starting a cipher operation.</description>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="DMA_DONE">
							<name>MAA_DONE</name>
							<description>MAA Done. MAA operation is complete. This bit must be cleared before starting a new MAA operation. This bit is read only while the MAA is in progress. This bit is negate of MAA_CTRL.STC.</description>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field>
							<name>ERR</name>
							<description>AHB Bus Error. This bit is set when the DMA encounters a bus error during a read or write operation. Once this bit is set, the DMA will stop. This bit can only be cleared by resetting the crypto block.</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<enumeratedValues>
								<name>error_enum</name>
								<enumeratedValue>
									<name>noError</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>Ready. Crypto block ready for more data.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<enumeratedValues>
								<name>ready_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DMA_DONE">
							<name>DONE</name>
							<description>Done. One or more cryptographic calculations complete (logical OR of done flags).</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>CIPHER_CTRL</name>
					<description>Cipher Control Register</description>
					<addressOffset>0x04</addressOffset>
					<fields>
						<field>
							<name>ENC</name>
							<description>Encrypt. Select encryption or decryption of input data.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>enc_dec_enum</name>
								<enumeratedValue>
									<name>encrypt</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>decrypt</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>KEY</name>
							<description>Load Key from crypto DMA. This bit is automatically cleared by hardware after the DMA has completed loading the key. When the DMA operation is done, it sets the appropriate crypto DMA Done flag.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRC</name>
							<description>Source of Random key</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>key_src_enum</name>
								<enumeratedValue>
									<name>cipherKey</name>
									<description>User cipher key (0x4000_1060)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>regFile</name>
									<description>Key from battery-backed register file (0x4000_5000 to 0x4000_501F)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIPHER</name>
							<description>Cipher Operation Select.  Symmetric Block Cipher algorithm selection or memory operation.</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>cipher_enum</name>
								<enumeratedValue>
									<name>disabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>aes128</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>aes192</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>aes256</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>des</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>tdea</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Mode Select. Mode of operation for block cipher or memory operation. DES/TDES cannot be used in CFB, OFB or CTR modes.</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<enumeratedValues>
								<name>cipher_mode_enum</name>
								<enumeratedValue>
									<name>ECB</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CBC</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CFB</name>
									<description>(AES only)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>OFB</name>
									<description>(AES only)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CTR</name>
									<description>(AES only)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HASH_CTRL</name>
					<description>HASH Control Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>INIT</name>
							<description>Initialize. Initializes hash registers with standard constants.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>nop</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XOR</name>
							<description>XOR data with IV from cipher block. Useful when calculating HMAC to XOR the input pad and output pad.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HASH</name>
							<description>Hash function selection</description>
							<lsb>2</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>hash_enum</name>
								<enumeratedValue>
									<name>disabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sha1</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sha224</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sha256</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sha384</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sha512</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LAST</name>
							<description>Last Message Bit. This bit shall be set along with the HASH_MSG_SZ register prior to hashing the last 512 or 1024-bit block of the message data. It will allow automatic preprocessing of the last message padding, which includes the trailing bit 1, followed by the respective number of zero bits for the last block size and finally the message length represented in bytes. The bit will be automatically cleared at the same time the HASH DONE is set, designating the completion of the last message hash.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>last_bit_enum</name>
								<enumeratedValue>
									<name>noEffect</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>lastMsgData</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CRC_CTRL</name>
					<description>CRC Control Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>CRC</name>
							<description>Cyclic Redundancy Check Enable. The CRC cannot be enabled if the PRNG is enabled.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSB</name>
							<description>MSB select. This bit selects the order of calculating CRC on data.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>msb_sel_enum</name>
								<enumeratedValue>
									<name>lsbFirst</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>msbFirst</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CRC">
							<name>PRNG</name>
							<description>Pseudo Random Number Generator Enable. If entropy is disabled, this outputs one byte of pseudo random data per clock cycle. If entropy is enabled, data is output at a rate of one bit per clock cycle.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="CRC">
							<name>ENT</name>
							<description>Entropy Enable. If the PRNG is enabled, this mixes the high frequency ring oscillator with the LFSR. If the PRNG is disabled, the raw entropy data is output at a rate of 1 bit per clock. This makes it possible to characterize the quality of the entropy source.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="CRC">
							<name>HAM</name>
							<description>Hamming Code Enable. Enable hamming code calculation.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field>
							<name>HRST</name>
							<description>Hamming Reset. Reset Hamming code ECC generator for next block.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<name>reset_write_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<description>Starts reset operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_SRC</name>
					<description>Crypto DMA Source Address</description>
					<addressOffset>0x10</addressOffset>
				</register>
				<register>
					<name>DMA_DEST</name>
					<description>Crypto DMA Destination Address</description>
					<addressOffset>0x14</addressOffset>
				</register>
				<register>
					<name>DMA_CNT</name>
					<description>Crypto DMA Byte Count</description>
					<addressOffset>0x18</addressOffset>
				</register>
