cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register>
					<name>MAA_CTRL</name>
					<description>MAA Control Register</description>
					<addressOffset>0x1C</addressOffset>
					<fields>
						<field>
							<name>STC</name>
							<description>Start Calculation. This bit functions as both the control and the status of the MAA. If the size value in the MAWS register is invalid, the STC bit will be cleared by hardware immediately.  Otherwise, the STC bit is automatically cleared following the completion of each calculation or detecting an error. Clearing the STC bit resets the controller to its default state.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>nop</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLC</name>
							<description>Calculation Configuration. These bits select desired calculation.</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>calc_enum</name>
								<enumeratedValue>
									<name>exp</name>
									<description>Exponentiation</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sq</name>
									<description>Square operation</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>mul</name>
									<description>Multiplication</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sqMul</name>
									<description>Square followed by a multiplication</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>add</name>
									<description>Addition</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sub</name>
									<description>Subtraction</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do no use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OCALC</name>
							<description>Optimized Calculation Control.  For optimized calculation, unnecessary multiply operations after normalizing the exponent are skipped.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MAAER</name>
							<description>MAA Error. The MAAER bit defaults to 0 and can only be set by hardware. Once set, it must be cleared by software otherwise no new operation can be initiated.  Software writes 1 to this bit has no effect and MAAER will maintain its original state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>error_enum</name>
								<enumeratedValue>
									<name>noError</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AMS</name>
							<description>Multiplier A Memory Select.  These bits select the starting position of the parameter "a" within the logical segment specified by AMA.</description>
							<lsb>8</lsb>
							<msb>9</msb>
						</field>
						<field>
							<name>BMS</name>
							<description>Multiplicand B Memory Select.  These bits select the starting position of the parameter b within the logical segment specified by BMA.</description>
							<lsb>10</lsb>
							<msb>11</msb>
						</field>
						<field>
							<name>EMS</name>
							<description>Exponent Memory Select.  These bits select the starting position of the parameter e within the logical segment specified by EMA.</description>
							<lsb>12</lsb>
							<msb>13</msb>
						</field>
						<field>
							<name>MMS</name>
							<description>Modulus Memory Select.  These bits select the starting position of the parameter m within the logical segment 5.</description>
							<lsb>14</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>AMA</name>
							<description>Multiplier / Operand A Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter a.</description>
							<lsb>16</lsb>
							<msb>19</msb>
						</field>
						<field>
							<name>BMA</name>
							<description>Multiplicand / Operand B Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter b.</description>
							<lsb>20</lsb>
							<msb>23</msb>
						</field>
						<field>
							<name>RMA</name>
							<description>Result Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter r.</description>
							<lsb>24</lsb>
							<msb>27</msb>
						</field>
						<field>
							<name>TMA</name>
							<description>Temporary Memory Assignment. These bits select the logical cryptographic RAM segment for the parameter t.</description>
							<lsb>28</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>CRYPTO_DIN_%s</name>
					<description>Crypto Data Input. Data input can be written to this register instead of using the DMA. This register writes to the FIFO. This register occupies four successive words to allow the use of multi-store instructions. Words can be written to any location, they will be placed in the FIFO in the order they are written. The endian swap input control bit affects this register.</description>
					<addressOffset>0x20</addressOffset>
					<access>write-only</access>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>CRYPTO_DOUT_%s</name>
					<description>Crypto Data Output. Resulting data from cipher calculation. Data is placed in the lower words of these four registers depending on the algorithm. For block cipher modes, this register holds the result of most recent encryption or decryption operation. These registers are affected by the endian swap bits.</description>
					<addressOffset>0x30</addressOffset>
					<access>read-only</access>
				</register>
				<register>
					<name>CRC_POLY</name>
					<description>CRC Polynomial. The polynomial to be used for Galois Field calculations (CRC or LFSR) should be written to this register. This register is affected by the MSB control bit.</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0xEDB88320</resetValue>
				</register>
				<register>
					<name>CRC_VAL</name>
					<description>CRC Value. This is the state for the Galois Field. This register holds the result of a CRC calculation or the current state of the LFSR. This register is affected by the MSB control bit.</description>
					<addressOffset>0x44</addressOffset>
					<resetValue>0xFFFFFFFF</resetValue>
				</register>
				<register>
					<name>CRC_PRNG</name>
					<description>Pseudo Random Value. Output of the Galois Field shift register. This holds the resulting pseudo-random number if entropy is disabled or true random number if entropy is enabled.</description>
					<addressOffset>0x48</addressOffset>
					<access>read-only</access>
				</register>
				<register>
					<name>HAM_ECC</name>
					<description>Hamming ECC Register</description>
					<addressOffset>0x4C</addressOffset>
					<fields>
						<field>
							<name>ECC</name>
							<description>Hamming ECC Value. These bits are the even parity of their corresponding bit groups.</description>
							<lsb>0</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>PAR</name>
							<description>Parity. This is the parity of the entire array.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>parity_enum</name>
								<enumeratedValue>
									<name>even</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>odd</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>CIPHER_INIT_%s</name>
					<description>Initial Vector. For block cipher operations that use CBC, CFB, OFB, or CNTR modes, this register holds the initial value. This register is updated with each encryption or decryption operation. This register is affected by the endian swap bits.</description>
					<addressOffset>0x50</addressOffset>
				</register>
				<register>
					<dim>8</dim>
					<dimIncrement>4</dimIncrement>
					<name>CIPHER_KEY_%s</name>
					<description>Cipher Key.  This register holds the key used for block cipher operations. The lower words are used for block ciphers that use shorter key lengths. This register is affected by the endian swap input control bits.</description>
					<addressOffset>0x60</addressOffset>
					<access>write-only</access>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>HASH_DIGEST_%s</name>
					<description>This register holds the calculated hash value. This register is affected by the endian swap bits.</description>
					<addressOffset>0x80</addressOffset>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>4</dimIncrement>
					<name>HASH_MSG_SZ_%s</name>
					<description>Message Size. This register holds the lowest 32-bit of message size in bytes.</description>
					<addressOffset>0xC0</addressOffset>
				</register>
				<register>
					<name>MAA_MAWS</name>
					<description>MAA Word Size. This register defines the number of bits for a modular operation. This register must be set to a valid value prior to the MAA operation start. Valid values are from 1 to 2048.  Invalid values are ignored and will not initiate a MAA operation.</description>
					<addressOffset>0xD0</addressOffset>
					<size>12</size>
				</register>
