cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>DAC</name>
			<description>Digital to Analog Converter</description>
			<prependToName>DAC_</prependToName>
			<baseAddress>0x40038000</baseAddress>
			<interrupt><name>DAC</name><value>21</value></interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>DAC Control Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>DACFAECNT</name>
							<description>DAC FIFO Almost Empty Level.  This value serves as a threshold- if the write data pointer in the FIFO exceeds this count, then the DACFAE flag is set.</description>
							<lsb>0</lsb>
							<msb>3</msb>
						</field>
						<field>
							<name>DACFAF</name>
							<description>FIFO Almost Full</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field derivedFrom="DACFAF">
							<name>DACFE</name>
							<description>FIFO Empty</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field derivedFrom="DACFAF">
							<name>DACFAE</name>
							<description>FIFO Almost Empty</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>DACINTERPMODE</name>
							<description>DAC Interpolation Mode</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<enumeratedValues>
								<name>interp_mode_enum</name>
								<enumeratedValue>
									<name>disabled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>interp1to2</name>
									<description>1:2 Interpolation</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>interp1to4</name>
									<description>1:4 Interpolation</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>interp1to8</name>
									<description>1:8 Interpolation</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DACFFCNT</name>
							<description>DAC FIFO Almost Full Level.  This value serves as a threshold: if the write data pointer in the FIFO exceeds this count, then the DACFAF flag is set.</description>
							<lsb>12</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>DACSTMODE</name>
							<description>DAC Output Start Mode</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<enumeratedValues>
								<name>start_mode_enum</name>
								<enumeratedValue>
									<name>notEmpty</name>
									<description>Start on FIFO not empty</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>strobe</name>
									<description>Start on local DAC Start Strobe</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPUDACST</name>
							<description>DAC Start Strobe.  The CPU may write this bit to a 1 to start a conversion when DACSTMODE = 10.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>DACMODE</name>
							<description>DAC Operation Mode</description>
							<lsb>24</lsb>
							<msb>25</msb>
							<enumeratedValues>
								<name>dac_op_mode_enum</name>
								<enumeratedValue>
									<name>onAvail</name>
									<description>Output Data in FIFO as soon as available.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>perDacRateCnt</name>
									<description>Output DacSmplCnt[15:0] Data points from FIFO at Ts defined by DacRateCnt[15:0].</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>perDacReg</name>
									<description>Use DAC_REG control.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>toModeChange</name>
									<description>Output DacSmplCnt[15:0] Data points from FIFO at Ts until mode changed.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DACPU</name>
							<description>DAC Power Up.  Writing this bit to a 1 will power up the DAC.</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DACPU">
							<name>DACCLKEN</name>
							<description>DAC Interface Clk Gate Enable.  Writing this bit to a 1 will enable clock to use DAC.</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field>
							<name>DACRST</name>
							<description>DAC Timing Generator Reset. Setting this bit to a 1 resets the FIFO and all state machines.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>write-only</access>
							<enumeratedValues>
								<name>reset_write_enum</name>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<description>Starts reset operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RATE</name>
					<description>DAC Output Rate and Sample Control</description>
					<addressOffset>0x04</addressOffset>
					<fields>
						<field>
							<name>DACRATECNT</name>
							<description>Delay between output samples in DACMODE=01.  Ts = (DACRATECNT + 2)*(1/24MHz) based on a 12MHz crystal.</description>
							<lsb>0</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>DACSAMPLECNT</name>
							<description>Number of data points to output in DACMODE=01.  If DACINTERPMODE = 0, DACSMPLCNT = Number samples to output. Else, DACSMPLCNT = (Number uninterpolated samples -1) * 2^DACINTERPMODE + 1.</description>
							<lsb>16</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>INT</name>
					<description>DAC Interrupt Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>DACDONEISR</name>
							<description>DAC output Done Interrupt status.  This bit is set to a 1 by hardware when an interrupt is triggered by the DAC output Done condition.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
							<enumeratedValues>
								<name>flag_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							<enumeratedValues>
								<name>w1c_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DACDONEISR">
							<name>DACFUFISR</name>
							<description>FIFO underflow interrupt status.  This bit is set to a 1 by hardware when an interrupt is triggered by the DAC FIFO Underflow condition.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="DACDONEISR">
							<name>DACFAEISR</name>
							<description>FIFO almost empty interrupt status.  This bit is set to a 1 by hardware when an interrupt is triggered by the DAC FIFO Almost Empty condition.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>DACDONEIE</name>
							<description>DAC Output Done Interrupt enable.   Setting this bit to a 1 allows the DAC output condition to trigger an interrupt.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DACDONEIE">
							<name>DACFUFIE</name>
							<description>FIFO underflow interrupt enable.  Setting this bit to a 1 allows the FIFO underflow condition to trigger an interrupt.</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="DACDONEIE">
							<name>DACFAEIE</name>
							<description>FIFO almost empty interrupt enable.  Setting this bit to a 1 allows the FIFO almost empty condition to trigger an interrupt.</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>REG</name>
					<description>DAC Input Register</description>
					<addressOffset>0x0C</addressOffset>
				</register>
