cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<resetValue>0x00007004</resetValue>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>DMAController</name>
			<description>Fully programmable, chaining capable DMA channels</description>
			<prependToName>DMA</prependToName>
			<baseAddress>0x40028000</baseAddress>
			<interrupt><name>DMA0</name><value>28</value></interrupt>
			<interrupt><name>DMA1</name><value>29</value></interrupt>
			<interrupt><name>DMA2</name><value>30</value></interrupt>
			<interrupt><name>DMA3</name><value>31</value></interrupt>
			<registers>
				<register>
					<name>_CN</name>
					<description>DMA Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>4</size>
					<fields>
						<field>
							<name>CH0_IEN</name>
							<description>Channel 0 Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CH0_IEN">
							<name>CH1_IEN</name>
							<description>Channel 1 Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="CH0_IEN">
							<name>CH2_IEN</name>
							<description>Channel 2 Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="CH0_IEN">
							<name>CH3_IEN</name>
							<description>Channel 3 Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>_INT</name>
					<description>DMA Interrupt Register</description>
					<addressOffset>0x004</addressOffset>
					<size>4</size>
					<access>read-only</access>
					<fields>
						<field>
							<name>CH0_IPEND</name>
							<description>Channel Interrupt.   To clear an interrupt, all active interrupt bits of the DMA_ST must be cleared. The interrupt bits are set only if their corresponding interrupt enable bits are set in DMA_CN.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CH0_IPEND">
							<name>CH1_IPEND</name>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="CH0_IPEND">
							<name>CH2_IPEND</name>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="CH0_IPEND">
							<name>CH3_IPEND</name>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_CFG</name>
					<description>DMA Channel Configuration Register</description>
					<addressOffset>0x100</addressOffset>
					<fields>
						<field>
							<name>CHEN</name>
							<description>Channel Enable.  This bit is automatically cleared when DMA_ST.CH_ST changes from 1 to 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CHEN">
							<name>RLDEN</name>
							<description>Reload Enable. Setting this bit to 1 enables DMA_SRC, DMA_DST and DMA_CNT to be reloaded with their corresponding reload registers upon count-to-zero. This bit is also writeable in the Count Reload Register. Refer to the description on Buffer Chaining for use of this bit. If buffer chaining is not used this bit must be written with a 0. This bit should be set after the reload registers have been programmed.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field>
							<name>PRI</name>
							<description>DMA Priority</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>priority_enum</name>
								<enumeratedValue>
									<name>high</name>
									<description>Highest Priority</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>medHigh</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>medLow</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>low</name>
									<description>Lowest Priority</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REQSEL</name>
							<description>Request Select. Select DMA request line for this channel. If memory-to-memory is selected, the channel operates as if the request is always active.</description>
							<lsb>4</lsb>
							<msb>9</msb>
							<enumeratedValues>
								<name>dma_transfer_enum</name>
								<enumeratedValue>
									<name>memToMem</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi0Rx</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi1Rx</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi2Rx</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>uart0Rx</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>uart1Rx</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>i2cRx</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>msrT1Rx</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>msrT2Rx</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>msrT3Rx</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi0Tx</name>
									<value>33</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi1Tx</name>
									<value>34</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>spi2Tx</name>
									<value>35</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>uart0Tx</name>
									<value>36</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>uart1Tx</name>
									<value>37</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>i2cTx</name>
									<value>39</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do no use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CHEN">
							<name>REQWAIT</name>
							<description>Request Wait Enable.  When enabled, delay timer start until DMA request transitions from active to inactive.</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field>
							<name>TOSEL</name>
							<description>Time-Out Select. Selects the number of prescale clocks seen by the channel timer before a time-out conditions is generated for this channel. Important note: since the prescaler runs independent of the individual channel timers, the actual number of Pre-Scale clock edges seen has a margin of error equal to a single Pre-Scale clock.</description>
							<lsb>11</lsb>
							<msb>13</msb>
							<enumeratedValues>
								<name>timeout_enum</name>
								<enumeratedValue>
									<name>to4</name>
									<description>Timeout of 3 to 4 prescale clocks</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to8</name>
									<description>Timeout of 7 to 8 prescale clocks</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to16</name>
									<description>Timeout of 15 to 16 prescale clocks</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to32</name>
									<description>Timeout of 31 to 32 prescale clocks</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to64</name>
									<description>Timeout of 63 to 64 prescale clocks</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to128</name>
									<description>Timeout of 127 to 128 prescale clocks</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to256</name>
									<description>Timeout of 255 to 256 prescale clocks</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>to512</name>
									<description>Timeout of 511 to 512 prescale clocks</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PSSEL</name>
							<description>Pre-Scale Select. Selects the Pre-Scale divider for timer clock input.</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<enumeratedValues>
								<name>prescale_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<description>Disable timer</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div256</name>
									<description>hclk / 256</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div64k</name>
									<description>hclk / 64k</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div16M</name>
									<description>hclk / 16M</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SRCWD</name>
							<description>Source Width. In most cases, this will be the data width of each AHB transactions. However, the width will be reduced in the cases where DMA_CNT indicates a smaller value.</description>
							<lsb>16</lsb>
							<msb>17</msb>
							<enumeratedValues>
								<name>width_enum</name>
								<enumeratedValue>
									<name>byte</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>halfWord</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CHEN">
							<name>SRCINC</name>
							<description>Source Increment Enable. This bit enables DMA_SRC increment upon every AHB transaction. This bit is forced to 0 for DMA receive from peripherals.</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="SRCWD">
							<name>DSTWD</name>
							<description>Destination Width. Indicates the width of the each AHB transactions to the destination peripheral or memory. (The actual width may be less than this if there are insufficient bytes in the DMA FIFO for the full width).</description>
							<lsb>20</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="CHEN">
							<name>DSTINC</name>
							<description>Destination Increment Enable. This bit enables DMA_DST increment upon every AHB transaction. This bit is forced to 0 for DMA transmit to peripherals.</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field>
							<name>BRST</name>
							<description>Burst Size. The number of bytes to be transferred into and out of the DMA FIFO in a single burst.  Burst size equals 1 + value stored in this field.</description>
							<lsb>24</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="CHEN">
							<name>CHDIEN</name>
							<description>Channel Disable Interrupt Enable. When enabled, the IPEND will be set to 1 whenever CH_ST changes from 1 to 0.</description>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="CHEN">
							<name>CTZIEN</name>
							<description>Count-to-zero Interrupts Enable. When enabled, the IPEND will be set to 1 whenever a count-to-zero event occurs.</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_ST</name>
					<description>DMA Channel Status Register</description>
					<addressOffset>0x104</addressOffset>
					<fields>
						<field>
							<name>CH_ST</name>
							<description>Channel Status. This bit is used to indicate to the programmer when it is safe to change the configuration, address, and count registers for the channel. Whenever this bit is cleared by hardware,  the DMA_CFG.CHEN bit is also cleared (if not cleared already).</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IPEND</name>
							<description>Channel Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTZ_ST</name>
							<description>Count-to-Zero (CTZ) Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
							<enumeratedValues>
								<name>event_flag_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>noEvent</name>
									<description>The event has not occurred</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>occurred</name>
									<description>The event has occurred</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							<enumeratedValues>
								<name>w1c_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CTZ_ST">
							<name>RLD_ST</name>
							<description>Reload Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="CTZ_ST">
							<name>BUS_ERR</name>
							<description>Bus Error. Indicates that an AHB abort was received and the channel has been disabled.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="CTZ_ST">
							<name>TO_ST</name>
							<description>Time-Out Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_SRC</name>
					<description>Source Device Address. If SRCINC=1, the counter bits are incremented by 1,2, or 4, depending on the data width of each AHB cycle. For peripheral transfers, some or all of the actual address bits are fixed. If SRCINC=0, this register remains constant. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with the contents of DMA_SRC_RLD.</description>
					<addressOffset>0x108</addressOffset>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_DST</name>
					<description>Destination Device Address. For peripheral transfers, some or all of the actual address bits are fixed. If DSTINC=1, this register is incremented on every AHB write out of the DMA FIFO. They are incremented by 1, 2, or 4, depending on the data width of each AHB cycle. In the case where a count-to-zero condition occurs while RLDEN=1, the register is reloaded with DMA_DST_RLD.</description>
					<addressOffset>0x10C</addressOffset>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_CNT</name>
					<description>DMA Counter. The user loads this register with the number of bytes to transfer. This counter decreases on every AHB cycle into the DMA FIFO. The decrement will be 1, 2, or 4 depending on the data width of each AHB cycle. When the counter reaches 0, a count-to-zero condition is triggered.</description>
					<addressOffset>0x110</addressOffset>
					<size>24</size>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_SRC_RLD</name>
					<description>Source Address Reload Value. The value of this register is loaded into DMA0_SRC upon a count-to-zero condition.</description>
					<addressOffset>0x0114</addressOffset>
					<size>31</size>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_DST_RLD</name>
					<description>Destination Address Reload Value. The value of this register is loaded into DMA0_DST upon a count-to-zero condition.</description>
					<addressOffset>0x118</addressOffset>
					<size>31</size>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x20</dimIncrement>
					<name>_%s_CNT_RLD</name>
					<description>DMA Channel Count Reload Register</description>
					<addressOffset>0x11C</addressOffset>
					<fields>
						<field>
							<name>CNT_RLD</name>
							<description>Count Reload Value. The value of this register is loaded into DMA0_CNT upon a count-to-zero condition.</description>
							<lsb>0</lsb>
							<msb>23</msb>
						</field>
						<field>
							<name>RLDEN</name>
							<description>Reload Enable. This bit should be set after the address reload registers have been programmed. This bit is automatically cleared to 0 when reload occurs.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
