cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>I2C</name>
			<description>Inter-Integrated Circuit</description>
			<prependToName>I2C_</prependToName>
			<baseAddress>0x4000C000</baseAddress>
			<baseAddress>0x4000C000</baseAddress>
			<interrupt><name>I2C</name><value>13</value></interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>Control Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>RXTHD</name>
							<description>Receive FIFO Threshold. This field specifies the depth of receive FIFO for interrupt generation.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>rx_thd_enum</name>
								<enumeratedValue>
									<name>ignored</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>word1</name>
									<description>1 word</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word2</name>
									<description>2 words</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word3</name>
									<description>3 words</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word4</name>
									<description>4 words</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word5</name>
									<description>5 words</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word6</name>
									<description>6 words</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word7</name>
									<description>7 words</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>word8</name>
									<description>8 words</description>
									<value>8</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AUTOSTT</name>
							<description>Auto Start. If this bit is 1, I2C communication starts automatically when a word is placed in the transmit FIFO.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>START</name>
							<description>Start communication. When 1 is written, I2C communication is started. This bit is automatically cleared by hardware when the first byte is sent.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="START">
							<name>RESTART</name>
							<description>Restart. When 1 is written, the communication restarts if the slave does not acknowledge the first byte (the address byte).</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="START">
							<name>STOP</name>
							<description>Stop Read communication. No effect on write communication.</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field derivedFrom="STOP">
							<name>TXFLUSH</name>
							<description>Flush Transmit FIFO. This bit is cleared by hardware.</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="START">
							<name>RXFLUSH</name>
							<description>Flush Receive FIFO. This bit is cleared by hardware.</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="AUTOSTT">
							<name>AFREAD</name>
							<description>Auto Read. If set to 1, this bit indicates that the current transfer should not be stopped but restarted when the transmit FIFO becomes empty (generally used to perform a read after a write transfer). The FREEZE bit should be set to prevent any error on the read operation. Use the I2C_ISR.RDYRDIS bit to know when you can write the slave address (in read mode) in the transmit FIFO.</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field derivedFrom="AFREAD">
							<name>FREEZE</name>
							<description>Freeze.  If set to 1, the I2C bus is frozen if the transmit FIFO is empty during a write or if the receive FIFO is full during a read.</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>Status Register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000050</resetValue>
					<fields>
						<field>
							<name>BUSY</name>
							<description>Busy. The I2C Bus is busy when another master is using the bus or this interface itself is using the bus.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>busy_enum</name>
								<enumeratedValue>
									<name>idle</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FROZEN</name>
							<description>Bus Frozen. This occurs when the clock signal is stuck at 0, such as being held by another device.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>frozen_enum</name>
								<enumeratedValue>
									<name>notFrozen</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>frozen</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>empty_enum</name>
								<enumeratedValue>
									<name>notEmpty</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>empty</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Receive FIFO Full</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>full_enum</name>
								<enumeratedValue>
									<name>notFull</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>full</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RXEMPTY">
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="RXFULL">
							<name>TXFULL</name>
							<description>Transmit FIFO Full</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>RXELT</name>
							<description>Number of byte in the RX FIFO</description>
							<lsb>8</lsb>
							<msb>11</msb>
						</field>
						<field>
							<name>TXELT</name>
							<description>Number of byte in the TX FIFO</description>
							<lsb>12</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>LOSTIE</name>
							<description>Loss of Transfer Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="LOSTIE">
							<name>NOANSIE</name>
							<description>Address NACK (not acknowledge) Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="LOSTIE">
							<name>COMENDIE</name>
							<description>Communication End Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="LOSTIE">
							<name>RDYRDIE</name>
							<description>Read Ready Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="LOSTIE">
							<name>FFRXIE</name>
							<description>Receive FIFO Threshold Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="LOSTIE">
							<name>FFTXOIE</name>
							<description>Transmit FIFO Last Word Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="LOSTIE">
							<name>FFTXHIE</name>
							<description>Transmit FIFO Last Four Words Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<description>Interrupt Status Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>LOSTIS</name>
							<description>Loss of Transfer Interrupt Status. This occurs when the current transfer is lost due to another master.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="LOSTIS">
							<name>NOANSIS</name>
							<description>Address NACK (not acknowledge) Interrupt Status. This occurs when no slave responds to the address.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="LOSTIS">
							<name>COMENDIS</name>
							<description>Communication End Interrupt Status. This occurs when the current transfer is over.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="LOSTIS">
							<name>RDYRDIS</name>
							<description>Read Ready Interrupt Status. This occurs when the current write transfer is done and the next read is ready to be processed (only if AFREAD=1).</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="LOSTIS">
							<name>FFRXIS</name>
							<description>Receive FIFO Threshold Status. This occurs when FIFO RX reaches the programmed threshold.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="LOSTIS">
							<name>FFTXOIS</name>
							<description>Transmit FIFO Last Word Interrupt Status. This occurs when there is only one byte remaining in the TX FIFO.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="LOSTIS">
							<name>FFTXHIS</name>
							<description>Transmit FIFO Last Four Words Interrupt Status. This occurs when there are four bytes remaining in the TX FIFO.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<description>Baud Rate Divisor. DIV = Nominal Frequency / (32 x Desired Frequency), where the nominal frequency  = 2 x fPLL0.</description>
					<addressOffset>0x10</addressOffset>
					<size>7</size>
				</register>
				<register>
					<name>RCR</name>
					<description>RX Count. Number of bytes to read. This register is used to specify how many bytes should be read from the device before stopping the communication.</description>
					<addressOffset>0x14</addressOffset>
					<size>16</size>
				</register>
				<register>
					<name>TXR</name>
					<description>TX FIFO Output. This register is used to read the output of the FIFO, reading this register does not read the FIFO itself. This register is mainly used for debug purpose.</description>
					<addressOffset>0x18</addressOffset>
					<size>8</size>
				</register>
				<register>
					<name>DR</name>
					<description>Data register. This register is used to obtain data from or place data into the FIFO. Read this register to retrieve the oldest data available in the RX FIFO. Write this register to place data in the TX FIFO.</description>
					<addressOffset>0x1C</addressOffset>
					<size>8</size>
				</register>
				<register>
					<name>DMR</name>
					<description>DMA Register</description>
					<addressOffset>0x2C</addressOffset>
					<fields>
						<field>
							<name>TXCNT</name>
							<description>TX threshold</description>
							<lsb>0</lsb>
							<msb>3</msb>
						</field>
						<field>
							<name>TXEN</name>
							<description>TX channel enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXCNT</name>
							<description>RX threshold</description>
							<lsb>5</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="TXEN">
							<name>RXEN</name>
							<description>RX channel enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
					</fields>
				</register>
