cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>MagneticStripeReader</name>
			<description>Magnetic Stripe Reader</description>
			<baseAddress>0x4002B000</baseAddress>
			<interrupt><name>MSR</name><value>22</value></interrupt>
			<registers>
				<register>
					<name>DSPADDR</name>
					<description>MSR Indirect Address Register Access. Indirectly access MSR settings registers by writing the index to this register. The register values are accessible by reading the DSPDATA register.</description>
					<addressOffset>0x00</addressOffset>
					<size>8</size>
					<fields>
						<field>
							<name>ADDR</name>
							<description>MSR Indirect Address Register Access</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>mcr_regs_enum</name>
								<enumeratedValue>
									<name>t13Scale</name>
									<description>Track 1 and 3 scale factor</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t2Scale</name>
									<description>Track 2 scale factor</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t13ZctFast</name>
									<description>Zero Cross Threshold Fast for Tracks 1 and 3</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t13ZctMid</name>
									<description>Zero Cross Threshold Middle for Tracks 1 and 3</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t13ZctSlow</name>
									<description>Zero Cross Threshold Slow for Tracks 1 and 3</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t2ZctFast</name>
									<description>Zero Cross Threshold Fast for Track 2</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t2ZctMid</name>
									<description>Zero Cross Threshold Middle for Track 2</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t2ZctSlow</name>
									<description>Zero Cross Threshold Slow for Track 2</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>startPcnt</name>
									<description>Leading 0 Detection Count</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t1DataCnt</name>
									<description>Track 1 Data Count</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t2DataCnt</name>
									<description>Track 2 Data Count</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>t3DataCnt</name>
									<description>Track 3 Data Count</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>adcCfg</name>
									<description>ADC Configuration</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do no use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DSPCTRL</name>
					<description>MSR DSP Control Register</description>
					<addressOffset>0x04</addressOffset>
					<resetValue>0x00001A00</resetValue>
					<fields>
						<field>
							<name>DSPEN</name>
							<description>DSP Enable.  Setting this bit to 1 enables the DSP Functionality. Clearing this bit to 0 disables the DSP.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSP_PKDETECT</name>
							<description>DSP Peak Detect Threshold Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>pk_detect_enum</name>
								<enumeratedValue>
									<name>variable</name>
									<description>Select Variable Threshold Mode</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fixed</name>
									<description>Select Fixed Threshold Mode</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DSPEN">
							<name>FIFO_INT_EN</name>
							<description>DSP FIFO Interrupt Enable.  Enable the FIFO To cause an interrupt when ready to be read.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>DSP_INTF</name>
							<description>DSP Interrupt Flag.  Set to 1 by hardware when swipe is complete.  Can be set or cleared by software.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DSP_INTF">
							<name>T1_INTF</name>
							<description>T1 FIFO Interrupt Flag.  Set by hardware when FIFO is ready for reading.  Can be set or cleared by software.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="DSP_INTF">
							<name>T2_INTF</name>
							<description>T2 FIFO Interrupt Flag.  Set by hardware when FIFO is ready for reading.  Can be set or cleared by software.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="DSP_INTF">
							<name>T3_INTF</name>
							<description>T3 FIFO Interrupt Flag.  Set by hardware when FIFO is ready for reading.  Can be set or cleared by software.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>DIV_RATIO</name>
							<description>ADC clock divide ratio.  ADC_CLK freq. = PCLK freq. / (DIV_RATIO + 1)</description>
							<lsb>8</lsb>
							<msb>14</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>DSPDATA</name>
					<description>MSR Indirect Data Register. Indirectly access MSR settings registers by access this register. This register represents an index register whose index is written to DSPADDR register.</description>
					<addressOffset>0x08</addressOffset>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<dim>3</dim>
					<dimIncrement>4</dimIncrement>
					<dimIndex>1,2,3</dimIndex>
					<name>T%sFIFO</name>
					<description>Track FIFO Data Output Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>16</size>
					<access>read-only</access>
				</register>
