cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>MonoLCDController</name>
			<description>LCD Interface</description>
			<prependToName>LCD_</prependToName>
			<baseAddress>0x40030000</baseAddress>
			<interrupt><name>LCD_TFT</name><value>12</value></interrupt>
			<registers>
				<register>
					<name>CN</name>
					<description>LCD Control Register</description>
					<addressOffset>0x00</addressOffset>
					<resetValue>0x00000080</resetValue>
					<fields>
						<field>
							<name>TXIE</name>
							<description>Data Transmit Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TXIE">
							<name>RXIE</name>
							<description>Data Receive Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="TXIE">
							<name>AE</name>
							<description>Automatic Mode Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>NIBBLE</name>
							<description>Bus Width Select</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>bus_width_enum</name>
								<enumeratedValue>
									<name>width8bit</name>
									<description>8 bit bus width</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>width4bit</name>
									<description>4 bit bus width (This feature is only available when AUTOEN=1)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RS</name>
							<description>Register Select. This bit sets the logic level of the LCD_RS pin.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<enumeratedValue>
									<name>lo</name>
									<description>Logic 0 (low)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Logic 1 (high)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RS">
							<name>RW</name>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>ENB</name>
							<description>Enable (Active Low). In Automatic Mode, this bit sets the polarity of the LCD_EN pin. (0: LCD_EN is active high. 1: LCD_EN is active low.) In Manual Mode, this bit directly sets the LCD_EN pin state.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>enb_enum</name>
								<enumeratedValue>
									<name>loOrActiveHi</name>
									<description>If automatic mode, LCD_EN is active high, else LCD is set low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hiOrActiveLo</name>
									<description>If automatic mode, LCD_EN is active low, else LCD is set high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>READ</name>
							<lsb>7</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>EPR</name>
					<description>LCD Enable Period Register. This register specifies the number of system clock cycles for an access. It is twice the asserted time of the enable signal (LCD_EN pin). This register has a minimum value of 4.  Any value less than 4 will be set to 4.</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<resetValue>0x00000018</resetValue>
				</register>
				<register>
					<name>SR</name>
					<description>LCD Status Register</description>
					<addressOffset>0x08</addressOffset>
					<resetValue>0x00000004</resetValue>
					<fields>
						<field>
							<name>TXIS</name>
							<description>Transmission Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>sent_enum</name>
								<enumeratedValue>
									<name>notSent</name>
									<description>The content of the data register has not yet been sent.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>sent</name>
									<description>The content of the data register has been sent. This bit is set by hardware and must be cleared by software to be acknowledged.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXIS</name>
							<description>Receive Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>rcvd_enum</name>
								<enumeratedValue>
									<name>noDataAvailable</name>
									<description>No data has been received.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>dataAvailable</name>
									<description>Data is available in LCD_DATA register. This bit is set by hardware and must be cleared by software to be acknowledged.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>READY</name>
							<description>LCD Ready</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>ready_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Data register for LCD read/write operation</description>
					<addressOffset>0x0C</addressOffset>
					<size>8</size>
				</register>
