cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>RealTimeClock</name>
			<description>Real Time Clock and Alarm</description>
			<prependToName>RTC_</prependToName>
			<baseAddress>0x40006000</baseAddress>
			<interrupt><name>RTC</name><value>3</value></interrupt>
			<registers>
				<register>
					<name>SEC</name>
					<description>RTC Second Counter. This register contains the 32-bit second counter.</description>
					<addressOffset>0x00</addressOffset>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>SSEC</name>
					<description>RTC Sub-second Counter. This counter increments at 256Hz. RTC_SEC is incremented when this register rolls over from 0xFF to 0x00.</description>
					<addressOffset>0x04</addressOffset>
					<size>8</size>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>RAS</name>
					<description>Time-of-day Alarm</description>
					<addressOffset>0x08</addressOffset>
					<size>20</size>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>RSSA</name>
					<description>RTC sub-second alarm.  This register contains the reload value for the sub-second alarm.</description>
					<addressOffset>0x0C</addressOffset>
					<size>8</size>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>CN</name>
					<description>RTC Control Register</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000008</resetValue>
					<resetMask>0xFFFFFF38</resetMask>
					<fields>
						<field>
							<name>RTCE</name>
							<description>Real Time Clock Enable. This bit enables the Real Time Clock. This bit can only be written when WE=1 and BUSY =0. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RTCE">
							<name>ADE</name>
							<description>Alarm Time-of-Day Interrupt Enable. Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="RTCE">
							<name>ASE</name>
							<description>Alarm Sub-second Interrupt Enable.  Change to this bit is effective only after BUSY is cleared from 1 to 0.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>BUSY</name>
							<description>RTC Busy. This bit is set to 1 by hardware when changes to RTC registers required a synchronized version of the register to be in place.  This bit is automatically cleared by hardware.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>busy_enum</name>
								<enumeratedValue>
									<name>idle</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RDY</name>
							<description>RTC Ready. This bit is set to 1 by hardware when the RTC count registers update.  It can be cleared to 0 by software at any time. It will also be cleared to 0 by hardware just prior to an update of the RTC count register.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>ready_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RTCE">
							<name>RDYE</name>
							<description>RTC Ready Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>ALDF</name>
							<description>Time-of-Day Alarm Interrupt Flag.  This alarm is qualified as wake-up source to the processor.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="ALDF">
							<name>ALSF</name>
							<description>Sub-second Alarm Interrupt Flag. This alarm is qualified as wake-up source to the processor.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="RTCE">
							<name>SQE</name>
							<description>Square Wave Output Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field>
							<name>FT</name>
							<description>Frequency Output Selection. When SQE=1, these bits specify the output frequency on the SQW pin.</description>
							<lsb>9</lsb>
							<msb>10</msb>
							<enumeratedValues>
								<name>freq_sel_enum</name>
								<enumeratedValue>
									<name>freq1Hz</name>
									<description>1 Hz (Compensated)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq512Hz</name>
									<description>512 Hz (Compensated)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>rtcInput</name>
									<description>RTC Input Clock</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>X32KMD</name>
							<description>32KHz Oscillator Mode.</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<enumeratedValues>
								<name>osc_mode_enum</name>
								<enumeratedValue>
									<name>noiseImmuneMode</name>
									<description>Always operate in Noise Immune Mode.  Oscillator warm-up required.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>quietMode</name>
									<description>Always operate in Quiet Mode.  No oscillator warm-up required.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>quietInStopWithWarmup</name>
									<description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry.  Will wait for 32K oscillator warm-up before code execution on Stop Mode exit.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>quietInStopNoWarmup</name>
									<description>Operate in Noise Immune Mode normally, switch to Quiet Mode on Stop Mode entry.  Will not wait for 32K oscillator warm-up before code execution on Stop Mode exit.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RTCE">
							<name>WE</name>
							<description>Write Enable. This register bit serves as a protection mechanism against unintentional writes to critical RTC bits.</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>TRIM</name>
					<description>RTC Trim.  This register contains the 2's complement value that specifies the trim resolution. Each increment or decrement of the bit adds or subtracts 1ppm at each 4KHz clock value, with a maximum correction of +/- 127ppm.</description>
					<addressOffset>0x14</addressOffset>
					<size>8</size>
					<resetMask>0x00000000</resetMask>
				</register>
