cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>SecurityMonitor</name>
			<description>The Security Monitor block used to monitor system threat conditions</description>
			<baseAddress>0x40004000</baseAddress>
			<registers>
				<register>
					<name>EXTSCN</name>
					<description>External Sensor Control Register</description>
					<addressOffset>0x00</addressOffset>
					<resetMask>0x3800FFC0</resetMask>
					<fields>
						<field>
							<name>EXTS_EN0</name>
							<description>External Sensor Enable for input/output pair 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="EXTS_EN0">
							<name>EXTS_EN1</name>
							<description>External Sensor Enable for input/output pair 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="EXTS_EN0">
							<name>EXTS_EN2</name>
							<description>External Sensor Enable for input/output pair 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="EXTS_EN0">
							<name>EXTS_EN3</name>
							<description>External Sensor Enable for input/output pair 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="EXTS_EN0">
							<name>EXTS_EN4</name>
							<description>External Sensor Enable for input/output pair 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="EXTS_EN0">
							<name>EXTS_EN5</name>
							<description>External Sensor Enable for input/output pair 5</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>EXTCNT</name>
							<description>External Sensor Error Counter. These bits set the number of external sensor accepted mismatches that have to occur within a single bit period before an external sensor alarm is triggered.</description>
							<lsb>16</lsb>
							<msb>20</msb>
						</field>
						<field>
							<name>EXTFRQ</name>
							<description>External Sensor Frequency. These bits define the frequency at which the external sensors are clocked to/from the EXTS_IN and EXTS_OUT pair.</description>
							<lsb>21</lsb>
							<msb>23</msb>
							<enumeratedValues>
								<name>exts_freq_enum</name>
								<enumeratedValue>
									<name>freq2000Hz</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq1000Hz</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq500Hz</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq250Hz</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq125Hz</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq63Hz</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>freq31Hz</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DIVCLK</name>
							<description>Clock Divide.  These bits are used to divide the 8KHz input clock. The resulting divided clock is used for all logic within the Security Monitor Block. Note: If the input clock is divided with these bits, the error count threshold table and output frequency will be affected accordingly with the same divide factor.</description>
							<lsb>24</lsb>
							<msb>26</msb>
							<enumeratedValues>
								<name>clk_div_enum</name>
								<enumeratedValue>
									<name>div1</name>
									<description>Divide by 1 (8000 Hz)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div2</name>
									<description>Divide by 2 (4000 Hz)</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div4</name>
									<description>Divide by 4 (2000 Hz)</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div8</name>
									<description>Divide by 8 (1000 Hz)</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div16</name>
									<description>Divide by 16 (500 Hz)</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div32</name>
									<description>Divide by 32 (250 Hz)</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div64</name>
									<description>Divide by 64 (125 Hz)</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BUSY</name>
							<description>Busy. This bit is set to 1 by hardware after EXTSCN register is written to. This bit is automatically cleared to 0 after this register information has been transferred to the security monitor domain.</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>busy_enum</name>
								<enumeratedValue>
									<name>idle</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock Register. Once locked, the EXTSCN register can no longer be modified.  Only a battery disconnect will clear this bit. VBAT powers this register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<enumeratedValues>
								<name>locked_enum</name>
								<enumeratedValue>
									<name>unlocked</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>INTSCN</name>
					<description>Internal Sensor Control Register</description>
					<addressOffset>0x04</addressOffset>
					<resetMask>0x7F00FFF7</resetMask>
					<fields>
						<field>
							<name>SHIELD_EN</name>
							<description>Die Shield Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>TEMP_EN</name>
							<description>Temperature Sensor Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VBAT_EN</name>
							<description>Battery Monitor Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>LOTEMP_SEL</name>
							<description>Low Temperature Detection Select</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>temp_sel_enum</name>
								<enumeratedValue>
									<name>neg50C</name>
									<description>-50 degrees C</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>neg30C</name>
									<description>-30 degrees C</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VCORELOEN</name>
							<description>VCORE Undervoltage Detect Enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VCOREHIEN</name>
							<description>VCORE Overvoltage Detect Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VDDLOEN</name>
							<description>VDD Undervoltage Detect Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VDDHIEN</name>
							<description>VDD Overvoltage Detect Enable</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="SHIELD_EN">
							<name>VGLEN</name>
							<description>Voltage Glitch Detection Enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field>
							<name>LOCK</name>
							<description>Lock Register. Once locked, the INTSCN register can no longer be modified.  Only a battery disconnect will clear this bit. VBAT powers this register.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<enumeratedValues>
								<name>locked_enum</name>
								<enumeratedValue>
									<name>unlocked</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>locked</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SECALM</name>
					<description>Security Alarm Register</description>
					<addressOffset>0x08</addressOffset>
					<resetValue>0x00000020</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DRS</name>
							<description>Destructive Reset Trigger. Setting this bit will generate a DRS. This bit is self-cleared by hardware.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DRS">
							<name>KEYWIPE</name>
							<description>Key Wipe Trigger. Set to 1 to initiate a wipe of the AES key register. It does not reset the part, or log a timestamp. AES and DES registers are not affected by this bit. This bit is automatically cleared to 0 after the keys have been wiped.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field>
							<name>SHIELDF</name>
							<description>Die Shield Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>event_flag_enum</name>
								<enumeratedValue>
									<name>noEvent</name>
									<description>The event has not occurred</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>occurred</name>
									<description>The event has occurred</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SHIELDF">
							<name>LOTEMP</name>
							<description>Low Temperature Detect</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>HITEMP</name>
							<description>High Temperature Detect</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>BATLO</name>
							<description>Battery Undervoltage Detect</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>BATHI</name>
							<description>Battery Overvoltage Detect</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTF</name>
							<description>External Sensor Flag.   This bit is set to 1 when any of the EXTSTAT bits are set.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>VDDLO</name>
							<description>VDD Undervoltage Detect Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>VCORELO</name>
							<description>VCORE Undervoltage Detect Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>VCOREHI</name>
							<description>VCORE Overvoltage Detect Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>VDDHI</name>
							<description>VDD Overvoltage Flag</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>VGL</name>
							<description>Voltage Glitch Detection Flag</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT0</name>
							<description>External Sensor 0 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT1</name>
							<description>External Sensor 1 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT2</name>
							<description>External Sensor 2 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT3</name>
							<description>External Sensor 3 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT4</name>
							<description>External Sensor 4 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT5</name>
							<description>External Sensor 5 Detect. The tamper detect is only active when it is enabled. This bits needs to be cleared in software after a tamper event to re-arm the sensor.</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN0</name>
							<description>External Sensor 0 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN1</name>
							<description>External Sensor 1 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN2</name>
							<description>External Sensor 2 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<msb>26</msb>
							<bitRange>26</bitRange>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN3</name>
							<description>External Sensor 3 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN4</name>
							<description>External Sensor 4 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSWARN5</name>
							<description>External Sensor 5 Warning Ready flag. The tamper detect warning flags are set, regardless of whether the external sensors are enabled.</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>SECDIAG</name>
					<description>Security Diagnostic Register</description>
					<addressOffset>0x0C</addressOffset>
					<resetValue>0x00000020</resetValue>
					<resetMask>0xFFC0FF03</resetMask>
					<fields>
						<field>
							<name>SHIELDF</name>
							<description>Die Shield Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>event_flag_enum</name>
								<enumeratedValue>
									<name>noEvent</name>
									<description>The event has not occurred</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>occurred</name>
									<description>The event has occurred</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SHIELDF">
							<name>LOTEMP</name>
							<description>Low Temperature Detect</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>HITEMP</name>
							<description>High Temperature Detect</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>BATLO</name>
							<description>Battery Undervoltage Detect</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>BATHI</name>
							<description>Battery Overvoltage Detect</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>DYNF</name>
							<description>Dynamic Sensor Flag.  This bit is set to 1 when any of the EXTSTAT bits are set.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>AESKT</name>
							<description>AES Key Transfer.  This bit is set to 1 when AES Key has been transferred from the TRNG to the battery backed AES key register. This bit can only be reset by a BOR.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>transfer_status_enum</name>
								<enumeratedValue>
									<name>incomplete</name>
									<description>Key has not been transferred.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>complete</name>
									<description>Key has been transferred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT0</name>
							<description>External Sensor 0 Detect</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT1</name>
							<description>External Sensor 1 Detect</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT2</name>
							<description>External Sensor 2 Detect</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT3</name>
							<description>External Sensor 3 Detect</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT4</name>
							<description>External Sensor 4 Detect</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="SHIELDF">
							<name>EXTSTAT5</name>
							<description>External Sensor 5 Detect</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>DLRTC</name>
					<description>DRS Log RTC Value. This register contains the 32 bit value in the RTC second register when the last DRS event occurred.</description>
					<addressOffset>0x10</addressOffset>
					<access>read-only</access>
					<resetMask>0x00000000</resetMask>
				</register>
				<register>
					<name>SECST</name>
					<description>Security Monitor Status Register</description>
					<addressOffset>0x34</addressOffset>
					<access>read-only</access>
					<fields>
						<field>
							<name>EXTSRS</name>
							<description>External Sensor Control Register Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>access_enum</name>
								<enumeratedValue>
									<name>allowed</name>
									<description>Access authorized</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>notAllowed</name>
									<description>Access not authorized</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="EXTSRS">
							<name>INTSRS</name>
							<description>Internal Sensor Control Register Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="EXTSRS">
							<name>SECALRS</name>
							<description>Security Alarm Register Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="EXTSRS">
							<name>KEY0RS</name>
							<description>AES Cipher Key Register x Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
					</fields>
				</register>
