cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>SPI0</name>
			<description>Serial Peripheral Interface</description>
			<prependToName>SPI0_</prependToName>
			<baseAddress>0x40018000</baseAddress>
			<interrupt><name>SPI0</name><value>16</value></interrupt>
			<registers>
				<register>
					<name>DATA</name>
					<description>SPI Data</description>
					<addressOffset>0x00</addressOffset>
					<size>16</size>
				</register>
				<register>
					<name>CNTL</name>
					<description>SPI Control Register</description>
					<addressOffset>0x04</addressOffset>
					<fields>
						<field>
							<name>SPIEN</name>
							<description>SPI Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MMEN</name>
							<description>SPI Master Mode Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>slv_mst_enum</name>
								<enumeratedValue>
									<name>slave</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>master</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SPIEN">
							<name>WOR</name>
							<description>Wired OR (open drain) Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>CLKPOL</name>
							<description>Clock Polarity</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>spi_pol_enum</name>
								<enumeratedValue>
									<name>idleLo</name>
									<description>SCLK idles Low (0) after character transmission/reception.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>idleHi</name>
									<description>SCLK idles High (1) after character transmission/reception.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PHASE</name>
							<description>Phase Select</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>spi_phase_enum</name>
								<enumeratedValue>
									<name>activeEdge</name>
									<description>Transmit on active edge of SCLK</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>inactiveEdge</name>
									<description>Transmit on inactive edge of SCLK</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SPIEN">
							<name>BIRQ</name>
							<description>Baud Rate Generator Timer Interrupt Request</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>STR</name>
							<description>Start SPI Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SPIEN">
							<name>IRQE</name>
							<description>Interrupt Request Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>SPI Status Register</description>
					<addressOffset>0x08</addressOffset>
					<resetValue>0x00000001</resetValue>
					<fields>
						<field>
							<name>SLAS</name>
							<description>Slave Select. If the SPI is in slave mode, this bit indicates if the SPI is selected. If the SPI is in master mode this bit has no meaning.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>sel_enum</name>
								<enumeratedValue>
									<name>selected</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>notSelected</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXST</name>
							<description>Transmit Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>busy_enum</name>
								<enumeratedValue>
									<name>idle</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TUND</name>
							<description>Transmit Underrun</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
							<enumeratedValues>
								<name>event_flag_enum</name>
								<enumeratedValue>
									<name>noEvent</name>
									<description>The event has not occurred</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>occurred</name>
									<description>The event has occurred.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TUND">
							<name>ROVR</name>
							<description>Receive Overrun</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="TUND">
							<name>ABT</name>
							<description>Slave Mode Transaction Abort</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="TUND">
							<name>COL</name>
							<description>Collision</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="TUND">
							<name>TOVR</name>
							<description>Transmit Overrun</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field>
							<name>IRQ</name>
							<description>SPI Interrupt Request</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MOD</name>
					<description>SPI Mode Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>SSV</name>
							<description>Slave Select Value</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<enumeratedValue>
									<name>lo</name>
									<description>The SSEL pin will be driven low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>The SSEL pin will be driven high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSIO</name>
							<description>Slave Select I/O</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>input_output_enum</name>
								<enumeratedValue>
									<name>input</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>output</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NUMBITS</name>
							<lsb>2</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>spi_bits_enum</name>
								<enumeratedValue>
									<name>bits16</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits1</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits2</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits3</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits4</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits5</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits6</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits7</name>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits8</name>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits9</name>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits10</name>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits11</name>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits12</name>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits13</name>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits14</name>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits15</name>
									<value>15</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX_LJ</name>
							<description>Transmit Left Justify</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSL1</name>
							<description>Slave Select 1.  If SPI is enabled and in master mode, the SSEL_1 is driven according to this bit.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>hi_lo_enum</name>
								<enumeratedValue>
									<name>hi</name>
									<description>High</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>lo</name>
									<description>Low</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SSL1">
							<name>SSL2</name>
							<description>Slave Select 2.  If SPI is enabled and in master mode, the SSEL_2 is driven according to this bit.</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="SSL1">
							<name>SSL3</name>
							<description>Slave Select 3.  If SPI is enabled and in master mode, the SSEL_3 is driven according to this bit.</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>BRG</name>
					<description>Baud Rate Reload Value. The SPI Baud Rate register is a 16-bit reload value for the SPI Baud Rate Generator. The reload value must be greater than or equal to 0002H for proper SPI operation (maximum baud rate is PCLK frequency divided by 4).</description>
					<addressOffset>0x14</addressOffset>
					<size>16</size>
					<resetValue>0x0000FFFF</resetValue>
				</register>
				<register>
					<name>DMA</name>
					<description>SPI DMA Register</description>
					<addressOffset>0x18</addressOffset>
					<resetValue>0x00070007</resetValue>
					<fields>
						<field>
							<name>TX_FIFO_LEVEL</name>
							<description>Transmit FIFO Level. Set the number of free entries in the TxFIFO when a TxDMA request occurs.</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>fifo_level_enum</name>
								<enumeratedValue>
									<name>entry1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries3</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries4</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries5</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries6</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries7</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>entries8</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX_FIFO_CLEAR</name>
							<description>Transmit FIFO Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TX_FIFO_CNT</name>
							<description>Transmit FIFO Count.</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TX_DMA_EN</name>
							<description>Transmit DMA Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TX_FIFO_LEVEL">
							<name>RX_FIFO_LEVEL</name>
							<description>Receive FIFO Level. Sets the RX FIFO DMA request threshold. This configures the number of filled RxFIFO entries before activating an RxDMA request.</description>
							<lsb>16</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="TX_FIFO_CLEAR">
							<name>RX_FIFO_CLEAR</name>
							<description>Receive FIFO Clear</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="TX_FIFO_CNT">
							<name>RX_FIFO_CNT</name>
							<description>Receive FIFO Count</description>
							<lsb>24</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="TX_DMA_EN">
							<name>RX_DMA_EN</name>
							<description>Receive DMA Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>I2S_CNTL</name>
					<description>I2S Control Register</description>
					<addressOffset>0x1C</addressOffset>
					<fields>
						<field>
							<name>I2S_EN</name>
							<description>I2S Mode Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="I2S_EN">
							<name>I2S_MUTE</name>
							<description>I2S Mute transmit</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="I2S_EN">
							<name>I2S_PAUSE</name>
							<description>I2S Pause transmit/receive</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="I2S_EN">
							<name>I2S_MONO</name>
							<description>I2S Monophonic Audio Mode</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="I2S_EN">
							<name>I2S_LJ</name>
							<description>I2S Left Justify</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
					</fields>
				</register>
