cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="SPI0">
			<name>SPI1</name>
			<description>Serial Peripheral Interface</description>
			<prependToName>SPI1_</prependToName>
			<baseAddress>0x40019000</baseAddress>
			<interrupt><name>SPI1</name><value>17</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="SPI0">
			<name>SPI2</name>
			<description>Serial Peripheral Interface</description>
			<prependToName>SPI2_</prependToName>
			<baseAddress>0x4001A000</baseAddress>
			<interrupt><name>SPI2</name><value>18</value></interrupt>
		</peripheral>
		<peripheral>
			<name>SmartCard</name>
			<description>LCD Clock Register</description>
			<prependToName>SC_</prependToName>
			<baseAddress>0x4002C000</baseAddress>
			<interrupt><name>Smart_Card</name><value>11</value></interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>Control Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>CONV</name>
							<description>Convention Select Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>convention_enum</name>
								<enumeratedValue>
									<name>direct</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>indirect</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CREP</name>
							<description>Character Repeat Enable Bit.  Enables character retransmit on parity error.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CREP">
							<name>WTEN</name>
							<description>Waiting Time Counter Enable Bit.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field>
							<name>UART</name>
							<description>Smart Card Mode Bit.  Selects manual control or smart card UART control of smart card pins.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>manual_auto_enum</name>
								<enumeratedValue>
									<name>manual</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>auto</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CREP">
							<name>CCEN</name>
							<description>Clock Counter Enable Bit.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field>
							<name>RXFLUSH</name>
							<description>Receive FIFO Flush Bit.  This bit is cleared automatically by hardware.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RXFLUSH">
							<name>TXFLUSH</name>
							<description>Transmit FIFO Flush Bit.  This bit is cleared automatically by hardware.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field>
							<name>RXTHD</name>
							<description>Receive FIFO depth.  Valid range 1 to 7.</description>
							<lsb>8</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="RXTHD">
							<name>TXTHD</name>
							<description>Transmit FIFO depth.  Valid range 1 to 7.</description>
							<lsb>12</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>START</name>
							<description>Start bit. This bit controls software activation/deactivation of the card interface. When this bit is set, the activation sequence for the selected card is performed.  When this bit is cleared, the deactivation sequence for the selected card is performed.  Hardware should automatically reset the START bit during emergency deactivation.</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>activation_enum</name>
								<enumeratedValue>
									<name>deactivation</name>
									<description>Deactivation performed.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activation</name>
									<description>Activation performed.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CREP">
							<name>BYPASS_PHY</name>
							<description>Bypass mode for smart card PHY.</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field>
							<name>PRPOL</name>
							<description>Presence detect polarity. When PRPOL = 0,  card presence pin shall interpret a logic 1 as card presence.  When PRPOL = 1, card presence pin shall interpret a logic 0 as card presence.</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<enumeratedValues>
								<name>pr_pol_enum</name>
								<enumeratedValue>
									<name>activeHi</name>
									<description>Logic 1 presence detect</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeLo</name>
									<description>Logic 0 presence detect</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CREP">
							<name>DEBNCE</name>
							<description>Enable Debounce on card insertion.  When set to logic 1, this will enable the hardware debounce of the card detect pin.  The debounce function shall wait for fixed timer period of stable card detect assertion before setting the SC_ISR.PRIS bit.  De-assertion of SC_ISR.PRIS is immediate upon de-assertion of card detect pin.</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="CREP">
							<name>BYPASS_SEQ</name>
							<description>Sequencer bypass.  Disable sequencer for activation and deactivation.</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>SR</name>
					<description>Status Register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000050</resetValue>
					<fields>
						<field>
							<name>PAR</name>
							<description>Parity Error Detected Flag. Set to 1 by hardware if parity error is detected.  Cleared by software.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>event_flag_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>noEvent</name>
									<description>The event has not occurred</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>occurred</name>
									<description>The event has occurred</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="PAR">
							<name>WTOV</name>
							<description>Waiting Time Counter Overflow Flag. Set to 1 by hardware when waiting time counter overflows.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field derivedFrom="WTOV">
							<name>CCOV</name>
							<description>Clock Counter Overflow Flag. Set to 1 by hardware when clock counter has reached its maximum value.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="PAR">
							<name>TXCF</name>
							<description>Transmit Complete Flag. Set to 1 by hardware when character has been transmitted.  Cleared by software.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Receive FIFO Empty Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>empty_enum</name>
								<enumeratedValue>
									<name>notEmpty</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>empty</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Receive FIFO Full Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>full_enum</name>
								<enumeratedValue>
									<name>notFull</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>full</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RXEMPTY">
							<name>TXEMPTY</name>
							<description>Transmit FIFO Empty Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="RXFULL">
							<name>TXFULL</name>
							<description>Receive FIFO Full Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>RXELT</name>
							<description>Number of bytes in Receive FIFO.</description>
							<lsb>8</lsb>
							<msb>11</msb>
						</field>
						<field>
							<name>TXELT</name>
							<description>Number of bytes in Transmit FIFO.</description>
							<lsb>12</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="PAR">
							<name>PRES</name>
							<description>Card Presence Indication. The presence indication depends on the polarity bit (SC_CR.PRPOL): PRPOL = 0=&gt; PRES=1 on rising edge of SC_DETECT, PRPOL = 1=&gt;PRES=1 on falling edge of SC_DETECT pin.  Cleared by hardware.</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="PAR">
							<name>PRC</name>
							<description>Protection Card Interface Status Flag.  This bit is set to a 1 by hardware when a fault is detected on the card reader interface.  A fault is defined as a detection of a short-circuit condition on the RST or Vcc pin.  This bit may be cleared by software to a 0.</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="PAR">
							<name>PDL</name>
							<description>Presence detect Level Status Flag.  This bit is set to a 1 when a level change has been detected on the SC_DETECT pin. If the interrupt is enabled for this flag, a system interrupt will be fired. If the interrupt enable is not set, the flag will be set, but no interrupt will fire.  This bit cleared by software.</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field>
							<name>ACTIV</name>
							<description>Activation Sequencer Status Flag.</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<name>op_status_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<description>Result not ready</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<description>Operation complete and result ready</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PN</name>
					<description>Pin Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>CRDRST</name>
							<description>Smart Card Reset Pin Control.  Writes to this bit set the associated pin logic level.  Reads from this bit return the logic value present on the associated pin.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>lo</name>
									<description>Logic 0 (low)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Logic 1 (high)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CRDRST">
							<name>CRDCLK</name>
							<description>Smart Card Clock Pin Control.  Writes to this bit set the associated pin logic level.  Reads from this bit return the logic value present on the associated pin.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="CRDRST">
							<name>CRDIO</name>
							<description>Smart Card I/O Pin Control.  Writes to this bit set the associated pin logic level.  Reads from this bit return the logic value present on the associated pin.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="CRDRST">
							<name>CRDC4</name>
							<description>Smart Card C4 Pin Control.  Writes to this bit set the associated pin logic level.  Reads from this bit return the logic value present on the associated pin.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="CRDRST">
							<name>CRDC8</name>
							<description>Smart Card C8 Pin Control.  Writes to this bit set the associated pin logic level.  Reads from this bit return the logic value present on the associated pin.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field>
							<name>CLKSEL</name>
							<description>Smart Card Clock Control Select</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>manual_auto_enum</name>
								<enumeratedValue>
									<name>manual</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>auto</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCCSEL</name>
							<description>Selects supply for smart card. This value must be set to select a target Vcc during card activation.</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<enumeratedValues>
								<name>sc_vcc_enum</name>
								<enumeratedValue>
									<name>v18</name>
									<description>1.8 V</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>v30</name>
									<description>3.0 V</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>v50</name>
									<description>5.0 V</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IO_C48_EN</name>
							<description>Smart Card IOs enable control, manual mode only (if SC_CR.BYPASS_SEQ= 1).</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="IO_C48_EN">
							<name>CLK_EN</name>
							<description>Smart Card CLK enable control, manual mode only (if SC_CR.BYPASS_SEQ= 1).</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="IO_C48_EN">
							<name>RST_EN</name>
							<description>Smart Card RST enable control, manual mode only (if SC_CR.BYPASS_SEQ= 1).</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="IO_C48_EN">
							<name>VCC_EN</name>
							<description>Smart Card supply enable control, manual mode only (if SC_CR.BYPASS_SEQ= 1).</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="IO_C48_EN">
							<name>RAMP_EN</name>
							<description>Smart Card LDO ramp enable control, manual mode only(if SC_CR.BYPASS_SEQ=1).</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>ETUR</name>
					<description>ETU Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>ETU</name>
							<description>Elemental Time Unit value. If HALF=0, Number of clocks in one asynchronous bit time. If HALF=1, Number of clocks in one half of one asynchronous bit time.</description>
							<lsb>0</lsb>
							<msb>14</msb>
						</field>
						<field>
							<name>COMP</name>
							<description>Compensation Mode Enable Bit. Controls 1 clock cycle subtraction of ETU value on odd bits.</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="COMP">
							<name>HALF</name>
							<description>Half ETU Count Selection Bit. NOTE: Guard Time (GT) and Wait Time (WT) must be doubled if HALF=1.</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>GTR</name>
					<description>Guard Time. Minimum time between two consecutive start bits in transmit mode.  Guard Time is expressed in ETUs. Guard Time must be doubled if ETUR.HALF=1. Writes to this register may be delayed up to two ETU cycles.</description>
					<addressOffset>0x10</addressOffset>
					<size>16</size>
				</register>
				<register>
					<name>WT0R</name>
					<description>Wait Time. Least Significant 32 bits of the Wait Time Counter expressed in ETU. Wait Time must be doubled if ETUR.HALF=1. writes to this register may be delayed up to two ETU cycles.</description>
					<addressOffset>0x14</addressOffset>
				</register>
				<register>
					<name>WT1R</name>
					<description>Wait Time. Most Significant 8 bits of the Wait Time Counter expressed in ETU. Wait Time must be doubled if ETUR.HALF=1. Writes to this register may be delayed up to two ETU cycles.</description>
					<addressOffset>0x18</addressOffset>
					<size>8</size>
				</register>
				<register>
					<name>IER</name>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x1C</addressOffset>
					<fields>
						<field>
							<name>PARIE</name>
							<description>Parity Error Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>WTIE</name>
							<description>Waiting Time Overflow Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>CTIE</name>
							<description>Clock Counter Overflow Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>TCIE</name>
							<description>Character Transmission Completion Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>RXEIE</name>
							<description>Receive FIFO Empty Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>RXTIE</name>
							<description>Receive FIFO Threshold Reached Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>RXFIE</name>
							<description>Receive FIFO Full Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>TXEIE</name>
							<description>Transmit FIFO Empty Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>TXTIE</name>
							<description>Transmit FIFO Threshold Reached Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>PRCIE</name>
							<description>Protection Card Interface Interrupt Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>PDLIE</name>
							<description>Presence Detect Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="PARIE">
							<name>ACTIVIE</name>
							<description>Activation Sequencer Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
					</fields>
				</register>
