cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register>
					<name>ISR</name>
					<description>Interrupt Status Register</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0x00000800</resetValue>
					<fields>
						<field>
							<name>PARIS</name>
							<description>Parity Error Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="PARIS">
							<name>WTIS</name>
							<description>Waiting Time Overflow Interrupt Status Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>CTIS</name>
							<description>Clock Counter Overflow Interrupt Status Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>TCIS</name>
							<description>Character Transmission Completion Interrupt Status Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>RXEIS</name>
							<description>Receive FIFO Empty Interrupt Status Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>RXTIS</name>
							<description>Receive FIFO Threshold Reached Interrupt Status Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>RXFIS</name>
							<description>Receive FIFO Full Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>TXEIS</name>
							<description>Transmit FIFO Empty Interrupt Status Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>TXTIS</name>
							<description>Transmit FIFO Threshold Reached Interrupt Status Flag</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>PRCIS</name>
							<description>Protection Card Interface Interrupt Status Flag</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>PDLIS</name>
							<description>Presence detect Interrupt Status Flag</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="PARIS">
							<name>ACTIVIS</name>
							<description>Activation Sequencer Interrupt Status Flag</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>TXR</name>
					<description>Transmit Data. Writes to this register will load the 8 bit input data into the FIFO.</description>
					<addressOffset>0x24</addressOffset>
					<size>8</size>
					<access>write-only</access>
				</register>
				<register>
					<name>RXR</name>
					<description>Receive Register</description>
					<addressOffset>0x28</addressOffset>
					<access>read-only</access>
					<fields>
						<field>
							<name>DATA</name>
							<description>Receive Data. Reads from this register will unload 8 bit receive data from the FIFO.</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>PARER</name>
							<description>Parity Error Detect Bit. Parity error bit associated with lower bits 7:0.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>error_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>noError</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<description>Clock Counter Register</description>
					<addressOffset>0x2C</addressOffset>
					<fields>
						<field>
							<name>CCYC</name>
							<description>Number of Clock Cycles to Count. Writes to this register may be delayed up to two ETU cycles.</description>
							<lsb>0</lsb>
							<msb>23</msb>
						</field>
						<field>
							<name>MAN</name>
							<description>Manual Mode. The counter starts counting-down on if this bit is set instead of an AUTOMATIC hardware mechanism.</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>TFTController</name>
			<description>Color LCD Controller</description>
			<prependToName>CLDC_</prependToName>
			<baseAddress>0x40031000</baseAddress>
			<registers>
				<register>
					<name>CLK</name>
					<description>LCD Clock Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>CLKDIV</name>
							<description>LCD Clock Divide Value. Pixel clock frequency is PClk divided by (CLKDIV +1)</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>ACB</name>
							<description>AC Bias frequency. AC bias pin toggles when the specified ACB +1 number of line clocks are applied (this field is ignored in TFT mode)</description>
							<lsb>8</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>DPOL</name>
							<description>Video Enable polarity</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>hi_lo_pol_enum</name>
								<enumeratedValue>
									<name>activeHi</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeLo</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DPOL">
							<name>VPOL</name>
							<description>Vertical Sync Polarity</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field>
							<name>HPOL</name>
							<description>Horizontal Sync Polarity</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<enumeratedValues>
								<name>lo_hi_pol_enum</name>
								<enumeratedValue>
									<name>activeLo</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeHi</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGE</name>
							<description>Clock Edge Select</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<enumeratedValues>
								<name>edge_sel_enum</name>
								<enumeratedValue>
									<name>posEdge</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>negEdge</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PASCLK</name>
							<description>Passive Clock (for STN, set to 0 for TFT)</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<enumeratedValues>
								<name>pas_clk_enum</name>
								<enumeratedValue>
									<name>alwaysActive</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeOnData</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VTIM_0</name>
					<description>LCD Vertical Timing 0 Register</description>
					<addressOffset>0x04</addressOffset>
					<fields>
						<field>
							<name>VLINES</name>
							<description>Vertical Lines.  Actual number of lines is 1 + register contents.</description>
							<lsb>0</lsb>
							<msb>11</msb>
						</field>
						<field>
							<name>VBACKPORCH</name>
							<description>Vertical Back Porch Lines</description>
							<lsb>16</lsb>
							<msb>23</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>VTIM_1</name>
					<description>LCD Vertical Timing 1 Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>VSYNCWIDTH</name>
							<description>Vertical Sync Width. Actual number of lines is 1 + register contents.</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>VFRONTPORCH</name>
							<description>Vertical Front Porch Lines</description>
							<lsb>16</lsb>
							<msb>23</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>HTIM</name>
					<description>LCD Horizontal  Timing Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>HSYNCWIDTH</name>
							<description>Horizontal Sync Width.  Actual number of clocks is 1 + register contents.</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>HFRONTPORCH</name>
							<description>Horizontal front porch in LCD clocks.  Actual number of clocks is 1 + register contents.</description>
							<lsb>8</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>HSIZE</name>
							<description>Horizontal Size (Pixels).  Actual number of pixels is 16 x (1 + register contents).</description>
							<lsb>16</lsb>
							<msb>23</msb>
						</field>
						<field>
							<name>HBACKPORCH</name>
							<description>Horizontal back porch in LCD clocks.  Actual number of clocks is 1 + register contents.</description>
							<lsb>24</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>LCD Control Register</description>
					<addressOffset>0x10</addressOffset>
					<fields>
						<field>
							<name>LCDEN</name>
							<description>LCD Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VISEL</name>
							<description>Vertical Compare Interrupt select</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>vci_sel_enum</name>
								<enumeratedValue>
									<name>onVertSync</name>
									<description>VCI on start of vertical sync</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>onVertBackPorch</name>
									<description>VCI on start of vertical back porch</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>onActiveVideo</name>
									<description>VCI on start of active video</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>onVertFrontPorch</name>
									<description>VCI on start of vertical front porch</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISPTYPE</name>
							<description>Display Type</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>disp_type_enum</name>
								<enumeratedValue>
									<name>stnColor8Bit</name>
									<description>STN Color 8 Bit</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>tft</name>
									<description>TFT</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BPP</name>
							<description>Bits per pixel</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<enumeratedValues>
								<name>bits_per_pix_enum</name>
								<enumeratedValue>
									<name>bpp1</name>
									<description>1 bit per pixel</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bpp2</name>
									<description>2 bits per pixel</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bpp4</name>
									<description>4 bits per pixel</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bpp8</name>
									<description>8 bits per pixel</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bpp16</name>
									<description>16 bits per pixel</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bpp24</name>
									<description>24 bits per pixel</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE565</name>
							<description>5:6:5 Mode Select</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<enumeratedValues>
								<name>tft_mod_sel_enum</name>
								<enumeratedValue>
									<name>mode555</name>
									<description>5:5:5 Mode Select</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>mode565</name>
									<description>5:6:5 Mode Select ( available from B1)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EMODE</name>
							<description>Endian Mode</description>
							<lsb>12</lsb>
							<msb>13</msb>
							<enumeratedValues>
								<name>endian_sel_enum</name>
								<enumeratedValue>
									<name>llbp</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bbbp</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>lbbp</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="LCDEN">
							<name>C24</name>
							<description>Compact 24 bit. This bit changes the TFT 24 bit color mode to compact display data storage. When set to one, each word contains 1 1/3 pixels of information. When 0 only the three bytes of the word are used for LCD data.</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>BURST</name>
							<description>Threshold and Burst Size Select</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<enumeratedValues>
								<name>burst_size_enum</name>
								<enumeratedValue>
									<name>words4</name>
									<description>FIFO burst size = 4 words</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>words8</name>
									<description>FIFO burst size = 8 words</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>words16</name>
									<description>FIFO burst size = 16 words</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LPOL</name>
							<description>LEND (Line End)  Polarity</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<enumeratedValues>
								<name>hi_lo_pol_enum</name>
								<enumeratedValue>
									<name>activeHi</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeLo</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="LCDEN">
							<name>PEN</name>
							<description>Power Enable to the panel</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>FRBUF_%s</name>
					<description>Frame Buffer Address. This address points to the start of the frame Buffer. This address is always word aligned and bits 1:0 are ignored.</description>
					<addressOffset>0x18</addressOffset>
				</register>
				<register>
					<name>INT_EN</name>
					<description>LCD Interrupt Enable Register</description>
					<addressOffset>0x20</addressOffset>
					<fields>
						<field>
							<name>UFLO</name>
							<description>FIFO underflow interrupt enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
						</field>
						<field derivedFrom="UFLO">
							<name>ADRRDY</name>
							<description>Address ready interrupt enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="UFLO">
							<name>VCI</name>
							<description>Vertical control interrupt enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="UFLO">
							<name>BERR</name>
							<description>Bus Error interrupt enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>LCD Status Register</description>
					<addressOffset>0x24</addressOffset>
					<resetValue>0x0000100</resetValue>
					<fields>
						<field>
							<name>UFLO</name>
							<description>FIFO underflow interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<modifiedWriteValues>oneToClear</modifiedWriteValues>
							<enumeratedValues>
								<name>flag_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
							<enumeratedValues>
								<name>w1c_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="UFLO">
							<name>ADRRDY</name>
							<description>Address ready interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="UFLO">
							<name>VCI</name>
							<description>Vertical control interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="UFLO">
							<name>BERR</name>
							<description>Bus Error interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field>
							<name>LCDIDLE</name>
							<description>LCD Idle. This bit can be read after the LCD enable bit is cleared to determine when the current frame is complete.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>op_status_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<description>Result not ready</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<description>Operation complete and result ready</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>HV_PHASE</name>
					<description>HSYNC-VSYNC Phase Difference in number of pixel clocks</description>
					<addressOffset>0x30</addressOffset>
					<size>8</size>
				</register>
