cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>Timer_0</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR0_</prependToName>
			<baseAddress>0x40010000</baseAddress>
			<interrupt><name>Timer0</name><value>5</value></interrupt>
			<registers>
				<register>
					<name>CNT</name>
					<description>Count.  This register stores the current timer count.</description>
					<addressOffset>0x00</addressOffset>
					<resetValue>0x00000001</resetValue>
				</register>
				<register>
					<name>CMP</name>
					<description>Compare.  This register stores the compare value, which is used to set the maximum count value to initiate a reload of the timer to 0x0001.</description>
					<addressOffset>0x04</addressOffset>
					<resetValue>0x0000FFFF</resetValue>
				</register>
				<register>
					<name>PWM</name>
					<description>PWM.  This register stores the value that is compared to the current timer count.</description>
					<addressOffset>0x08</addressOffset>
				</register>
				<register>
					<name>INT</name>
					<description>Clear Interrupt. Writing a value (0 or 1) to a bit in this register clears the associated interrupt.</description>
					<addressOffset>0x0C</addressOffset>
					<size>1</size>
					<modifiedWriteValues>clear</modifiedWriteValues>
				</register>
				<register>
					<name>CN</name>
					<description>Timer Control Register</description>
					<addressOffset>0x10</addressOffset>
					<fields>
						<field>
							<name>TMODE</name>
							<description>Timer Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>timer_mod_enum</name>
								<enumeratedValue>
									<name>oneShot</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>continuous</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>counter</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pwm</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>capture</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>compare</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>gated</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>captureCompare</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRES</name>
							<description>Prescaler.  The prescaler bits are formed from PRES3:PRES[2:0]</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>pres_enum</name>
								<enumeratedValue>
									<name>div1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div2</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div4</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div8</name>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div16</name>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div32</name>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div64</name>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div128</name>
									<value>7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TPOL</name>
							<description>Timer input/output polarity bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>hi_lo_pol_enum</name>
								<enumeratedValue>
									<name>activeHi</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>activeLo</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TEN</name>
							<description>Timer Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRES3</name>
							<description>MSB of prescaler value.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>pres3_enum</name>
								<enumeratedValue>
									<name>div1</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>div256</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TEN">
							<name>PWMSYNC</name>
							<description>Timer PWM Synchronization Mode Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="TEN">
							<name>NOLHPOL</name>
							<description>Timer PWM output 0A polarity bit.</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="TEN">
							<name>NOLLPOL</name>
							<description>Timer PWM output 0A' polarity bit.</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>NOLCMP</name>
					<description>Timer Non-Overlapping Compare Register</description>
					<addressOffset>0x14</addressOffset>
					<fields>
						<field>
							<name>NOLLCMP</name>
							<description>Non-overlapping Low Compare.  The 8-bit timer count value of non-overlapping time between falling edge of PWM output 0A and next rising edge of PWM output 0A'.</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>NOLHCMP</name>
							<description>Non-overlapping High Compare.  The 8-bit timer count value of non-overlapping time between falling edge of PWM output 0A' and next rising edge of PWM output 0A.</description>
							<lsb>8</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
