cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="Timer_0">
			<name>Timer_1</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR1_</prependToName>
			<baseAddress>0x40011000</baseAddress>
			<interrupt><name>Timer1</name><value>6</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="Timer_0">
			<name>Timer_2</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR2_</prependToName>
			<baseAddress>0x40012000</baseAddress>
			<interrupt><name>Timer2</name><value>7</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="Timer_0">
			<name>Timer_3</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR3_</prependToName>
			<baseAddress>0x40013000</baseAddress>
			<interrupt><name>Timer3</name><value>8</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="Timer_0">
			<name>Timer_4</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR14_</prependToName>
			<baseAddress>0x40014000</baseAddress>
			<interrupt><name>Timer4</name><value>9</value></interrupt>
		</peripheral>
		<peripheral derivedFrom="Timer_0">
			<name>Timer_5</name>
			<description>32-bit reloadable timer that can be used for timing and event counting.</description>
			<prependToName>TMR5_</prependToName>
			<baseAddress>0x40015000</baseAddress>
			<interrupt><name>Timer5</name><value>10</value></interrupt>
		</peripheral>
		<peripheral>
			<name>TrueRandomNumberGenerator</name>
			<description>Random Number Generator</description>
			<prependToName>TRNG_</prependToName>
			<baseAddress>0x400B5000</baseAddress>
			<interrupt><name>TRNG</name><value>4</value></interrupt>
			<registers>
				<register>
					<name>CN</name>
					<description>TRNG Control Register</description>
					<addressOffset>0x00</addressOffset>
					<resetValue>0x00000003</resetValue>
					<fields>
						<field>
							<name>RNG_IE</name>
							<description>Random Number Interrupt Enable. This bit enables an interrupt to be generated when a new, 128 bit, random number is ready to be read.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RNG_ISC</name>
							<description>Random Number Interrupt Status Clear. Setting this bit to 1 clears the RNG_I4S bit and acknowledges the interrupt, if enabled. This bit is a write only bit and always reads as zero.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<name>w1c_enum</name>
								<usage>write</usage>
								<enumeratedValue>
									<name>RFU</name>
									<description>Reserved. Do not use.</description>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RNG_I4S</name>
							<description>Random Number 4 Word Status. This bit is set when a new 128 bit random number is ready to be read (using 4 consecutive reads of the TRNG Data Register). When set, an interrupt will be generated if the RNG_IE bit is also set. This bit is cleared by setting the RNG_ISC bit.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>op_status_enum</name>
								<enumeratedValue>
									<name>busy</name>
									<description>Result not ready</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ready</name>
									<description>Operation complete and result ready</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RNG_I4S">
							<name>RNG_IS</name>
							<description>Random Number Word Status. This bit is set when at least one 32 bit random number is ready to be read. This bit is cleared by hardware if all the random words have been read. It is needed to poll this bit before reading the TRNG Data Register</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>AESKG</name>
							<description>AES Key Generate. When enabled, the key for securing NVSRAM is generated and transferred to the secure key register automatically without user visibility or intervention. This bit is cleared by hardware once the key has been transferred to the secure key register.</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>Data. The content of this register is valid only when RNG_IS = 1. When TRNG is disabled, read returns 0x0000 0000.</description>
					<addressOffset>0x04</addressOffset>
					<access>read-only</access>
				</register>
