cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral>
			<name>UART0</name>
			<description>UART0 (Serial Port 0)</description>
			<prependToName>UART0_</prependToName>
			<baseAddress>0x40020000</baseAddress>
			<interrupt><name>UART0</name><value>14</value></interrupt>
			<registers>
				<register>
					<name>CTRL</name>
					<description>UART Control Register</description>
					<addressOffset>0x00</addressOffset>
					<fields>
						<field>
							<name>RXTHD</name>
							<description>Number of bytes that must be loaded into the receive FIFO before the FFRXIS interrupt will be triggered.</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>rx_thd_enum</name>
								<enumeratedValue>
									<name>ignored</name>
									<isDefault>true</isDefault>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes1</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 1 byte or higher.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes2</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 2 bytes or higher.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes3</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 3 bytes or higher.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes4</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 4 bytes or higher.</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes5</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 5 bytes or higher.</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes6</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 6 bytes or higher.</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes7</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 7 bytes or higher.</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bytes8</name>
									<description>Interrupt will be triggered when the number of bytes in the RX FIFO reaches 8 bytes or higher.</description>
									<value>8</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PAREN</name>
							<description>Enables/disables generation and testing of parity bit.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PAREO</name>
							<description>Selects odd or even parity (when PAREN=1).</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>parity_enum</name>
								<enumeratedValue>
									<name>even</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>odd</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PARMD</name>
							<description>Selects parity based on 1s or 0s count (when PAREN=1).</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>par_md_enum</name>
								<enumeratedValue>
									<name>count1s</name>
									<description>Parity calculation is based on number of 1s in frame.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>count0s</name>
									<description>Parity calculation is based on number of 0s in frame.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXFLUSH</name>
							<description>Flushes the TX FIFO buffer.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TXFLUSH">
							<name>RXFLUSH</name>
							<description>Flushes the RX FIFO buffer.</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field>
							<name>SIZE</name>
							<description>Selects UART character size.</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<enumeratedValues>
								<name>ch_size_enum</name>
								<enumeratedValue>
									<name>bits5</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits6</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits7</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>bits8</name>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STOP</name>
							<description>Selects the number of stop bits that will be generated.</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<enumeratedValues>
								<name>stop_bit_enum</name>
								<enumeratedValue>
									<name>stop1</name>
									<description>1 stop bit</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>stop15</name>
									<description>1.5 stop bits (for 5 bit mode) or 2 stop bits (for 6/7/8 bit mode)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="PAREN">
							<name>RTSCTSF</name>
							<description>Enables/disables hardware flow control.</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>STAT</name>
					<description>UART Status Register</description>
					<addressOffset>0x04</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000050</resetValue>
					<fields>
						<field>
							<name>TXBUSY</name>
							<description>Read-only flag indicating the UART transmit status.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>busy_enum</name>
								<enumeratedValue>
									<name>idle</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>busy</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="TXBUSY">
							<name>RXBUSY</name>
							<description>Read-only flag indicating the UART receiver status.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field>
							<name>RXEMPTY</name>
							<description>Read-only flag indicating the RX FIFO state.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>empty_enum</name>
								<enumeratedValue>
									<name>notEmpty</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>empty</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXFULL</name>
							<description>Read-only flag indicating the RX FIFO state.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>full_enum</name>
								<enumeratedValue>
									<name>notFull</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>full</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="RXEMPTY">
							<name>TXEMPTY</name>
							<description>Read-only flag indicating the TX FIFO state.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="RXFULL">
							<name>TXFULL</name>
							<description>Read-only flag indicating the TX FIFO state.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>RXELT</name>
							<description>Indicates the number of bytes currently in the RX FIFO (0-8)</description>
							<lsb>8</lsb>
							<msb>11</msb>
						</field>
						<field>
							<name>TXELT</name>
							<description>Indicates the number of bytes currently in the TX FIFO (0-8)</description>
							<lsb>12</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>INT_EN</name>
					<description>UART Interrupt Enable Register</description>
					<addressOffset>0x08</addressOffset>
					<fields>
						<field>
							<name>FRAMIE</name>
							<description>Enable for RX Frame Error Interrupt.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="FRAMIE">
							<name>PARITYIE</name>
							<description>Enable for RX Parity Error interrupt.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="FRAMIE">
							<name>SIGNALIE</name>
							<description>Enable for CTS signal change interrupt (hardware flow control disabled).</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="FRAMIE">
							<name>OVERIE</name>
							<description>Enable for RX FIFO Overrun interrupt.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="FRAMIE">
							<name>FFRXIE</name>
							<description>Enable for interrupt when RX FIFO reaches the number of bytes configured by the RXTHD field.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="FRAMIE">
							<name>FFTXOIE</name>
							<description>Enable for interrupt when TX FIFO has only one byte remaining.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="FRAMIE">
							<name>FFTXHIE</name>
							<description>Enable for interrupt when TX FIFO is half empty or less.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>INT_STAT</name>
					<description>UART Interrupt Status Register</description>
					<addressOffset>0x0C</addressOffset>
					<fields>
						<field>
							<name>FRAMIS</name>
							<description>Flag for RX Frame Error Interrupt.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<modifiedWriteValues>zeroToClear</modifiedWriteValues>
						</field>
						<field derivedFrom="FRAMIS">
							<name>PARITYIS</name>
							<description>Flag for RX Parity Error interrupt.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="FRAMIS">
							<name>SIGNALIS</name>
							<description>Flag for CTS signal change interrupt (hardware flow control disabled).</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="FRAMIS">
							<name>OVERIS</name>
							<description>Flag for RX FIFO Overrun interrupt.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="FRAMIS">
							<name>FFRXIS</name>
							<description>Flag for interrupt when RX FIFO reaches the number of bytes configured by the RXTHD field.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="FRAMIS">
							<name>FFTXOIS</name>
							<description>Flag for interrupt when TX FIFO has only one byte remaining.</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="FRAMIS">
							<name>FFTXHIS</name>
							<description>Flag for interrupt when TX FIFO is half empty or less.</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>BAUD0</name>
					<description>UART Baud Rate 0 Register. Integer portion of baud rate divisor value. Use the following formula to obtain the proper value for this field: IDIV = (integer portion of) 'Nominal Frequency' / (128 x Baud Rate Frequency) where the 'Nominal Frequency' = 2xfPLL0. The integer portion is rounded value (i.e. 5.7 becomes 5).</description>
					<addressOffset>0x10</addressOffset>
					<size>12</size>
				</register>
				<register>
					<name>BAUD1</name>
					<description>UART Baud Rate 1 Register. Decimal portion of baud rate divisor value. Use the following formula to obtain the proper value for this field after obtaining IDIV: DIV = 'Nominal Frequency' / (128 x Baud Rate Frequency).  DDIV = (DIV - IDIV) x 128, where the 'Nominal Frequency' = 2xfPLL0.</description>
					<addressOffset>0x14</addressOffset>
					<size>7</size>
				</register>
				<register>
					<name>PIN</name>
					<description>UART Pin Control Register</description>
					<addressOffset>0x1C</addressOffset>
					<resetValue>0X00000003</resetValue>
					<fields>
						<field>
							<name>CTS</name>
							<description>Current state of CTS I/O pin.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>lo</name>
									<description>Logic 0 (low)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Logic 1 (high)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="CTS">
							<name>RTS</name>
							<description>If hardware flow control is disabled, this bit is used to control the RTS I/O pin output state. This bit has no effect when RTSCTSF=1.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>UART Data Buffer Register</description>
					<addressOffset>0x20</addressOffset>
					<fields>
						<field>
							<name>DATA</name>
							<description>Load/unload location for TX and RX FIFO buffers.</description>
							<lsb>0</lsb>
							<msb>7</msb>
						</field>
						<field>
							<name>PARITY</name>
							<description>Parity error flag for next byte to be read from FIFO.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>error_enum</name>
								<usage>read</usage>
								<enumeratedValue>
									<name>noError</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>error</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA</name>
					<description>UART DMA Register</description>
					<addressOffset>0x30</addressOffset>
					<fields>
						<field>
							<name>TXCNT</name>
							<description>TX threshold for DMA transmission</description>
							<lsb>0</lsb>
							<msb>3</msb>
						</field>
						<field>
							<name>TXEN</name>
							<description>TX DMA channel enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXCNT</name>
							<description>RX threshold for DMA transmission</description>
							<lsb>5</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="TXEN">
							<name>RXEN</name>
							<description>RX DMA channel enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
					</fields>
				</register>
