cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
			</registers>
			<addressBlock>
				<offset>0x00</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
		</peripheral>
		<peripheral derivedFrom="UART0">
			<name>UART1</name>
			<description>UART1 (Serial Port 1)</description>
			<prependToName>UART1_</prependToName>
			<baseAddress>0x40021000</baseAddress>
			<interrupt><name>UART1</name><value>15</value></interrupt>
		</peripheral>
		<peripheral>
			<name>USB</name>
			<description>Universal Serial Bus</description>
			<prependToName>USB_</prependToName>
			<baseAddress>0x400B0000</baseAddress>
			<interrupt><name>USB</name><value>2</value></interrupt>
			<registers>
				<register>
					<name>CN</name>
					<description>USB Control Register</description>
					<addressOffset>0x000</addressOffset>
					<resetValue>0x000000B0</resetValue>
					<fields>
						<field>
							<name>USB_EN</name>
							<description>USB Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_ADDR</name>
					<description>USB Device Address Register</description>
					<addressOffset>0x200</addressOffset>
					<size>7</size>
				</register>
				<register>
					<name>DEV_CN</name>
					<description>USB Device Control Register</description>
					<addressOffset>0x204</addressOffset>
					<fields>
						<field>
							<name>SIGRWU</name>
							<description>USB Signal Remote Wakeup</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CONNECT</name>
							<description>Connect to USB</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>connect_enum</name>
								<enumeratedValue>
									<name>disconnect</name>
									<description>Disconnect pull up resistor between DPLUS and VBUS.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>connect</name>
									<description>Connect pull up resistor between DPLUS and VBUS.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SIGRWU">
							<name>ULPM</name>
							<description>USB Low Power Mode. On receiving a USB suspend interrupt, software can put the USB transceiver into a low power state by setting this bit to 1.  To return the USB transceiver to normal operation, software can clear this bit to 0.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field>
							<name>URST</name>
							<description>USB Device Controller Reset. When URST is set to 1, the USB controller shall disconnect the device from the USB bus and then reset its states.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<enumeratedValues>
								<name>reset_enum</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>notReset</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>reset</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBGATE</name>
							<description>VBUS Gate</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>gate_enum</name>
								<enumeratedValue>
									<name>alwaysConnect</name>
									<description>CONNECT operation independent of VBUS status</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>connectOnVBUS</name>
									<description>CONNECT operation conditional on VBUS present</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="SIGRWU">
							<name>OSCEN</name>
							<description>Oscillator Enable. The oscillator is assumed to be ready when the USB controller is enabled.</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="SIGRWU">
							<name>BACT_OE</name>
							<description>Bus Activity Output Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field>
							<name>FIFO_MODE</name>
							<description>FIFO Mode. This setting reduces the likelihood of the device returning NAK due to a busy system bus. In the event of a data underflow (FIFO empty when more data is needed), the device controller will force a bit stuff error on the bus and terminate the packet.</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<enumeratedValues>
								<name>fifo_mod_enum</name>
								<enumeratedValue>
									<name>nakUntilComplete</name>
									<description>The device controller will return NAK to an IN request until the entire packet has been read from system memory into its internal FIFO.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>responOnDataAvail</name>
									<description>The device controller will respond to an IN request as soon as data becomes available in the FIFO.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_INT</name>
					<description>USB Device Interrupt Register</description>
					<addressOffset>0x208</addressOffset>
					<resetMask>0xFFFEFFFF</resetMask>
					<fields>
						<field>
							<name>DPACT</name>
							<description>DPLUS Activity. DPLUS activity is an interrupt source that will bring the core out of low power mode.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DPACT">
							<name>RWU_DN</name>
							<description>Remote Wakeup Signaling Done. This bit is cleared by a USB bus reset.</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BACT</name>
							<description>USB Bus Active. This bit is cleared by a USB bus reset.</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BRST</name>
							<description>USB Bus Reset. This bit is self-cleared by hardware at the end of the USB reset condition.</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>SUSP</name>
							<description>Suspend. This bit is cleared by a USB bus reset.</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>NO_VBUS</name>
							<description>No VBUS. This bit is cleared by a USB bus reset. This bit can be an interrupt source that will bring the core out of low power mode</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>VBUS</name>
							<description>VBUS Detect. This bit is cleared by a USB bus reset. This bit can be an interrupt source that will bring the core out of low power mode</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BRST_DN</name>
							<description>Bus Reset Done</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>SETUP</name>
							<description>Setup Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_IN</name>
							<description>Endpoint IN Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_OUT</name>
							<description>Endpoint OUT Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_NAK</name>
							<description>Endpoint NAK Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>DMA_ERR</name>
							<description>DMA Error</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BUF_OVR</name>
							<description>Buffer Overflow</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field>
							<name>VBUS_ST</name>
							<description>VBUS Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<name>lo_hi_enum</name>
								<usage>read-write</usage>
								<enumeratedValue>
									<name>lo</name>
									<description>Logic 0 (low)</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>hi</name>
									<description>Logic 1 (high)</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DEV_INT_EN</name>
					<description>USB Device Interrupt Enable Register</description>
					<addressOffset>0x20C</addressOffset>
					<fields>
						<field>
							<name>DPACT</name>
							<description>DPLUS Activity Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DPACT">
							<name>RWU_DN</name>
							<description>Remote Wakeup Signaling Done Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BACT</name>
							<description>USB Bus Active Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BRST</name>
							<description>USB Bus Reset Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>SUSP</name>
							<description>Suspend Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>NO_VBUS</name>
							<description>No VBUS Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>VBUS</name>
							<description>VBUS Detect Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BRST_DN</name>
							<description>Bus Reset Done Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>SETUP</name>
							<description>Endpoint SETUP Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_IN</name>
							<description>Endpoint IN Interrupt Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_OUT</name>
							<description>Endpoint OUT Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>EP_NAK</name>
							<description>Endpoint NAK Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>DMA_ERR</name>
							<description>DMA Error Interrupt Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="DPACT">
							<name>BUF_OVR</name>
							<description>Buffer Overflow</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>EP_BASE</name>
					<description>USB Endpoint Descriptor Base Address Register</description>
					<addressOffset>0x220</addressOffset>
					<fields>
						<field>
							<name>EP_BASE</name>
							<description>USB_Endpoint Descriptor Base Address.  This register defines the starting address of the endpoint descriptor in system memory. The descriptor address of each buffer in the endpoint is formed by: EP_BASE[31:9] : EP_DESCRIPTOR_OFFSET.</description>
							<lsb>9</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>CUR_BUF</name>
					<description>USB Current Buffer Register</description>
					<addressOffset>0x224</addressOffset>
					<fields>
						<field>
							<name>OUT_BUF_EP0</name>
							<description>EP0 OUT Transfer Current Buffer</description>
							<lsb>0</lsb>
							<msb>0</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP1</name>
							<description>EP1 OUT Transfer Current Buffer</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP2</name>
							<description>EP2 OUT Transfer Current Buffer</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP3</name>
							<description>EP3 OUT Transfer Current Buffer</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP4</name>
							<description>EP4 OUT Transfer Current Buffer</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP5</name>
							<description>EP5 OUT Transfer Current Buffer</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP6</name>
							<description>EP6 OUT Transfer Current Buffer</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP7</name>
							<description>EP7 OUT Transfer Current Buffer</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP8</name>
							<description>EP8 OUT Transfer Current Buffer</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP9</name>
							<description>EP9 OUT Transfer Current Buffer</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP10</name>
							<description>EP10 OUT Transfer Current Buffer</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP11</name>
							<description>EP11 OUT Transfer Current Buffer</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP12</name>
							<description>EP12 OUT Transfer Current Buffer</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP13</name>
							<description>EP13 OUT Transfer Current Buffer</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP14</name>
							<description>EP14 OUT Transfer Current Buffer</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>OUT_BUF_EP15</name>
							<description>EP15 OUT Transfer Current Buffer</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP0</name>
							<description>EP0 IN Transfer Current Buffer</description>
							<lsb>16</lsb>
							<msb>16</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP1</name>
							<description>EP1 IN Transfer Current Buffer</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP2</name>
							<description>EP2 IN Transfer Current Buffer</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP3</name>
							<description>EP3 IN Transfer Current Buffer</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP4</name>
							<description>EP4 IN Transfer Current Buffer</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP5</name>
							<description>EP5 IN Transfer Current Buffer</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP6</name>
							<description>EP6 IN Transfer Current Buffer</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP7</name>
							<description>EP7 IN Transfer Current Buffer</description>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP8</name>
							<description>EP8 IN Transfer Current Buffer</description>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP9</name>
							<description>EP9 IN Transfer Current Buffer</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP10</name>
							<description>EP10 IN Transfer Current Buffer</description>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP11</name>
							<description>EP11 IN Transfer Current Buffer</description>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP12</name>
							<description>EP12 IN Transfer Current Buffer</description>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP13</name>
							<description>EP13 IN Transfer Current Buffer</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP14</name>
							<description>EP14 IN Transfer Current Buffer</description>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="OUT_BUF_EP0">
							<name>IN_BUF_EP15</name>
							<description>EP15 IN Transfer Current Buffer</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
