cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register>
					<name>IN_OWNER</name>
					<description>USB IN Buffer Owner Register</description>
					<addressOffset>0x228</addressOffset>
					<fields>
						<field>
							<name>INBUF0_OWNER_EP0</name>
							<description>EP0 IN Buffer 0 Owner</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>owner_enum</name>
								<enumeratedValue>
									<name>software</name>
									<description>This endpoint's IN buffer 0 is owned by the software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>usbController</name>
									<description>This endpoint's IN buffer 0 is owned by the USB controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP1</name>
							<description>EP1 IN Buffer 0 Owner</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP2</name>
							<description>EP2 IN Buffer 0 Owner</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP3</name>
							<description>EP3 IN Buffer 0 Owner</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP4</name>
							<description>EP4 IN Buffer 0 Owner</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP5</name>
							<description>EP5 IN Buffer 0 Owner</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP6</name>
							<description>EP6 IN Buffer 0 Owner</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP7</name>
							<description>EP7 IN Buffer 0 Owner</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP8</name>
							<description>EP8 IN Buffer 0 Owner</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP9</name>
							<description>EP9 IN Buffer 0 Owner</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP10</name>
							<description>EP10 IN Buffer 0 Owner</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP11</name>
							<description>EP11 IN Buffer 0 Owner</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP12</name>
							<description>EP12 IN Buffer 0 Owner</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP13</name>
							<description>EP13 IN Buffer 0 Owner</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP14</name>
							<description>EP14 IN Buffer 0 Owner</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="INBUF0_OWNER_EP0">
							<name>INBUF0_OWNER_EP15</name>
							<description>EP15 IN Buffer 0 Owner</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>INBUF1_OWNER_EP0</name>
							<description>EP0 IN Buffer 1 Owner</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>owner_enum</name>
								<enumeratedValue>
									<name>software</name>
									<description>This endpoint's IN buffer 1 is owned by the software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>usbController</name>
									<description>This endpoint's IN buffer 1 is owned by the USB controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP1</name>
							<description>EP1 IN Buffer 1 Owner</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP2</name>
							<description>EP2 IN Buffer 1 Owner</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP3</name>
							<description>EP3 IN Buffer 1 Owner</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP4</name>
							<description>EP4 IN Buffer 1 Owner</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP5</name>
							<description>EP5 IN Buffer 1 Owner</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP6</name>
							<description>EP6 IN Buffer 1 Owner</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP7</name>
							<description>EP7 IN Buffer 1 Owner</description>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP8</name>
							<description>EP8 IN Buffer 1 Owner</description>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP9</name>
							<description>EP9 IN Buffer 1 Owner</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP10</name>
							<description>EP10 IN Buffer 1 Owner</description>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP11</name>
							<description>EP11 IN Buffer 1 Owner</description>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP12</name>
							<description>EP12 IN Buffer 1 Owner</description>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP13</name>
							<description>EP13 IN Buffer 1 Owner</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP14</name>
							<description>EP14 IN Buffer 1 Owner</description>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="INBUF1_OWNER_EP0">
							<name>INBUF1_OWNER_EP15</name>
							<description>EP15 IN Buffer 1 Owner</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT_OWNER</name>
					<description>USB OUT Buffer Owner Register</description>
					<addressOffset>0x22C</addressOffset>
					<fields>
						<field>
							<name>OUTBUF0_OWNER_EP0</name>
							<description>EP0 OUT Buffer 0 Owner</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>owner_enum</name>
								<enumeratedValue>
									<name>software</name>
									<description>This endpoint's OUT buffer 0 is owned by the software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>usbController</name>
									<description>This endpoint's OUT buffer 0 is owned by the USB controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP1</name>
							<description>EP1 OUT Buffer 0 Owner</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP2</name>
							<description>EP2 OUT Buffer 0 Owner</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP3</name>
							<description>EP3 OUT Buffer 0 Owner</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP4</name>
							<description>EP4 OUT Buffer 0 Owner</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP5</name>
							<description>EP5 OUT Buffer 0 Owner</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP6</name>
							<description>EP6 OUT Buffer 0 Owner</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP7</name>
							<description>EP7 OUT Buffer 0 Owner</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP8</name>
							<description>EP8 OUT Buffer 0 Owner</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP9</name>
							<description>EP9 OUT Buffer 0 Owner</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP10</name>
							<description>EP10 OUT Buffer 0 Owner</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP11</name>
							<description>EP11 OUT Buffer 0 Owner</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP12</name>
							<description>EP12 OUT Buffer 0 Owner</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP13</name>
							<description>EP13 OUT Buffer 0 Owner</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP14</name>
							<description>EP14 OUT Buffer 0 Owner</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="OUTBUF0_OWNER_EP0">
							<name>OUTBUF0_OWNER_EP15</name>
							<description>EP15 OUT Buffer 0 Owner</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
						<field>
							<name>OUTBUF1_OWNER_EP0</name>
							<description>EP0 OUT Buffer 1 Owner</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<enumeratedValues>
								<name>owner_enum</name>
								<enumeratedValue>
									<name>software</name>
									<description>This endpoint's OUT buffer 1 is owned by the software.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>usbController</name>
									<description>This endpoint's OUT buffer 1 is owned by the USB controller.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP1</name>
							<description>EP1 OUT Buffer 1 Owner</description>
							<lsb>17</lsb>
							<msb>17</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP2</name>
							<description>EP2 OUT Buffer 1 Owner</description>
							<lsb>18</lsb>
							<msb>18</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP3</name>
							<description>EP3 OUT Buffer 1 Owner</description>
							<lsb>19</lsb>
							<msb>19</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP4</name>
							<description>EP4 OUT Buffer 1 Owner</description>
							<lsb>20</lsb>
							<msb>20</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP5</name>
							<description>EP5 OUT Buffer 1 Owner</description>
							<lsb>21</lsb>
							<msb>21</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP6</name>
							<description>EP6 OUT Buffer 1 Owner</description>
							<lsb>22</lsb>
							<msb>22</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP7</name>
							<description>EP7 OUT Buffer 1 Owner</description>
							<lsb>23</lsb>
							<msb>23</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP8</name>
							<description>EP8 OUT Buffer 1 Owner</description>
							<lsb>24</lsb>
							<msb>24</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP9</name>
							<description>EP9 OUT Buffer 1 Owner</description>
							<lsb>25</lsb>
							<msb>25</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP10</name>
							<description>EP10 OUT Buffer 1 Owner</description>
							<lsb>26</lsb>
							<msb>26</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP11</name>
							<description>EP11 OUT Buffer 1 Owner</description>
							<lsb>27</lsb>
							<msb>27</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP12</name>
							<description>EP12 OUT Buffer 1 Owner</description>
							<lsb>28</lsb>
							<msb>28</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP13</name>
							<description>EP13 OUT Buffer 1 Owner</description>
							<lsb>29</lsb>
							<msb>29</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP14</name>
							<description>EP14 OUT Buffer 1 Owner</description>
							<lsb>30</lsb>
							<msb>30</msb>
						</field>
						<field derivedFrom="OUTBUF1_OWNER_EP0">
							<name>OUTBUF1_OWNER_EP15</name>
							<description>EP15 OUT Buffer 1 Owner</description>
							<lsb>31</lsb>
							<msb>31</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>IN_INT</name>
					<description>USB IN Interrupt Register</description>
					<addressOffset>0x230</addressOffset>
					<fields>
						<field>
							<name>INBAV_EP0</name>
							<description>EP0 IN Buffer Available Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP1</name>
							<description>EP1 IN Buffer Available Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP2</name>
							<description>EP2 IN Buffer Available Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP3</name>
							<description>EP3 IN Buffer Available Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP4</name>
							<description>EP4 IN Buffer Available Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP5</name>
							<description>EP5 IN Buffer Available Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP6</name>
							<description>EP6 IN Buffer Available Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP7</name>
							<description>EP7 IN Buffer Available Interrupt</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP8</name>
							<description>EP8 IN Buffer Available Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP9</name>
							<description>EP9 IN Buffer Available Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP10</name>
							<description>EP10 IN Buffer Available Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP11</name>
							<description>EP11 IN Buffer Available Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP12</name>
							<description>EP12 IN Buffer Available Interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP13</name>
							<description>EP13 IN Buffer Available Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP14</name>
							<description>EP14 IN Buffer Available Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="INBAV_EP0">
							<name>INBAV_EP15</name>
							<description>EP15 IN Buffer Available Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>OUT_INT</name>
					<description>USB OUT Interrupt Register</description>
					<addressOffset>0x234</addressOffset>
					<fields>
						<field>
							<name>OUTDAV_EP0</name>
							<description>EP0 OUT Buffer Data Available Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP1</name>
							<description>EP1 OUT Buffer Data Available Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP2</name>
							<description>EP2 OUT Buffer Data Available Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP3</name>
							<description>EP3 OUT Buffer Data Available Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP4</name>
							<description>EP4 OUT Buffer Data Available Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP5</name>
							<description>EP5 OUT Buffer Data Available Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP6</name>
							<description>EP6 OUT Buffer Data Available Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP7</name>
							<description>EP7 OUT Buffer Data Available Interrupt</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP8</name>
							<description>EP8 OUT Buffer Data Available Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP9</name>
							<description>EP9 OUT Buffer Data Available Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP10</name>
							<description>EP10 OUT Buffer Data Available Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP11</name>
							<description>EP11 OUT Buffer Data Available Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP12</name>
							<description>EP12 OUT Buffer Data Available Interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP13</name>
							<description>EP13 OUT Buffer Data Available Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP14</name>
							<description>EP14 OUT Buffer Data Available Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="OUTDAV_EP0">
							<name>OUTDAV_EP15</name>
							<description>EP15 OUT Buffer Data Available Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
