cmsis-svd/cmsis-svd/data/Maxim/max32550.svd
				<register>
					<name>NAK_INT</name>
					<description>USB NAK Interrupt Register</description>
					<addressOffset>0x238</addressOffset>
					<fields>
						<field>
							<name>NAK_EP0</name>
							<description>EP0 NAK Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP1</name>
							<description>EP1 NAK Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP2</name>
							<description>EP2 NAK Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP3</name>
							<description>EP3 NAK Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP4</name>
							<description>EP4 NAK Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP5</name>
							<description>EP5 NAK Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP6</name>
							<description>EP6 NAK Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP7</name>
							<description>EP7 NAK Interrupt</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP8</name>
							<description>EP8 NAK Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP9</name>
							<description>EP9 NAK Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP10</name>
							<description>EP10 NAK Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP11</name>
							<description>EP11 NAK Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP12</name>
							<description>EP12 NAK Interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP13</name>
							<description>EP13 NAK Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP14</name>
							<description>EP14 NAK Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="NAK_EP0">
							<name>NAK_EP15</name>
							<description>EP15 NAK Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>DMA_ERR_INT</name>
					<description>USB DMA Error Interrupt Register</description>
					<addressOffset>0x23C</addressOffset>
					<fields>
						<field>
							<name>DMA_ERR_EP0</name>
							<description>EP0 DMA Error Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP1</name>
							<description>EP1 DMA Error Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP2</name>
							<description>EP2 DMA Error Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP3</name>
							<description>EP3 DMA Error Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP4</name>
							<description>EP4 DMA Error Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP5</name>
							<description>EP5 DMA Error Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP6</name>
							<description>EP6 DMA Error Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP7</name>
							<description>EP7 DMA Error Interrupt</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP8</name>
							<description>EP8 DMA Error Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP9</name>
							<description>EP9 DMA Error Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP10</name>
							<description>EP10 DMA Error Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP11</name>
							<description>EP11 DMA Error Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP12</name>
							<description>EP12 DMA Error Interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP13</name>
							<description>EP13 DMA Error Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP14</name>
							<description>EP14 DMA Error Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="DMA_ERR_EP0">
							<name>DMA_ERR_EP15</name>
							<description>EP15 DMA Error Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<name>BUF_OVR_INT</name>
					<description>USB Buffer Overflow Interrupt Register</description>
					<addressOffset>0x240</addressOffset>
					<fields>
						<field>
							<name>BUF_OVR_EP0</name>
							<description>EP0 Buffer Overflow Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<enumeratedValues>
								<name>flag_enum</name>
								<enumeratedValue>
									<name>inactive</name>
									<description>No interrupt is pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>pending</name>
									<description>An interrupt is pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP1</name>
							<description>EP1 Buffer Overflow Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP2</name>
							<description>EP2 Buffer Overflow Interrupt</description>
							<lsb>2</lsb>
							<msb>2</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP3</name>
							<description>EP3 Buffer Overflow Interrupt</description>
							<lsb>3</lsb>
							<msb>3</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP4</name>
							<description>EP4 Buffer Overflow Interrupt</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP5</name>
							<description>EP5 Buffer Overflow Interrupt</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP6</name>
							<description>EP6 Buffer Overflow Interrupt</description>
							<lsb>6</lsb>
							<msb>6</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP7</name>
							<description>EP7 Buffer Overflow Interrupt</description>
							<lsb>7</lsb>
							<msb>7</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP8</name>
							<description>EP8 Buffer Overflow Interrupt</description>
							<lsb>8</lsb>
							<msb>8</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP9</name>
							<description>EP9 Buffer Overflow Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP10</name>
							<description>EP10 Buffer Overflow Interrupt</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP11</name>
							<description>EP11 Buffer Overflow Interrupt</description>
							<lsb>11</lsb>
							<msb>11</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP12</name>
							<description>EP12 Buffer Overflow Interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP13</name>
							<description>EP13 Buffer Overflow Interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP14</name>
							<description>EP14 Buffer Overflow Interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
						</field>
						<field derivedFrom="BUF_OVR_EP0">
							<name>BUF_OVR_EP15</name>
							<description>EP15 Buffer Overflow Interrupt</description>
							<lsb>15</lsb>
							<msb>15</msb>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>SETUP%s</name>
					<description>USB SETUP Register</description>
					<addressOffset>0x260</addressOffset>
					<access>read-only</access>
				</register>
				<register>
					<dim>16</dim>
					<dimIncrement>4</dimIncrement>
					<name>EP%s</name>
					<description>USB Endpoint Control Register</description>
					<addressOffset>0x280</addressOffset>
					<fields>
						<field>
							<name>EP_DIR</name>
							<description>Endpoint Direction</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<enumeratedValues>
								<name>ep_dir_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>out</name>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>in</name>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>control</name>
									<description>This configures the endpoint to be a CONTROL pipe accepting IN, OUT and SETUP packets.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP_BUF2</name>
							<description>Double Buffer Enable. For a single buffered endpoint, the SIE will only use buffer 0 associated with the endpoint transfer direction. For a doubled buffered endpoint, the SIE will ping pong between the two buffers.  This allows the SIE to transfer data to/from system memory while still communicating data to/from the host.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<enumeratedValues>
								<name>dis_en_enum</name>
								<enumeratedValue>
									<name>disable</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>enable</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="EP_BUF2">
							<name>EP_INT_EN</name>
							<description>Endpoint Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
						</field>
						<field derivedFrom="EP_BUF2">
							<name>EP_NAK_EN</name>
							<description>Endpoint NAK Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
						</field>
						<field>
							<name>EP_DT</name>
							<description>Endpoint Data Toggle Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<enumeratedValues>
								<name>start_op_enum</name>
								<enumeratedValue>
									<name>complete</name>
									<description>No operation/complete</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>start</name>
									<description>Start operation</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EP_STALL</name>
							<description>Endpoint Stalled. Any access to a stalled endpoint will cause the USB interface to return a STALL handshake.  For CONTROL endpoint, this bit is automatically cleared to 0 upon receiving a SETUP packet.</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<enumeratedValues>
								<name>stalled_enum</name>
								<enumeratedValue>
									<name>notStalled</name>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>stalled</name>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field derivedFrom="EP_BUF2">
							<name>EP_ST_STALL</name>
							<description>Stall Status Stage of Control Transfer. This bit determines whether a STALL will be returned to the Status Stage of a control transfer. The Stall Status Stage bit, together with the EP_ST_ACK bit, indicates to the SIE how to respond in the status stage of a Control transfer.   The EP_ST_STALL has priority over EP_ST_ACK.  Until software either acknowledges (EP_ST_ACK=1) or stalls the transfer (EP_ST_STALL=1), the SIE answers the status stage of a CONTROL transfer with the NAK handshake. Regardless of the setting of this bit, a CONTROL endpoint must receive a SETUP packet and respond with ACK if the packet is received successfully.  Upon receiving a SETUP packet, this bit is automatically cleared to 0.</description>
							<lsb>9</lsb>
							<msb>9</msb>
						</field>
						<field derivedFrom="EP_BUF2">
							<name>EP_ST_ACK</name>
							<description>Acknowledge Status Stage of Control Transfer. This bit determines whether an ACK will be returned to the Status Stage of a control transfer. Until software either acknowledges (EP_ST_ACK=1) or stalls the transfer (EP_ST_STALL=1), the SIE answers the status stage of a CONTROL transfer with the NAK handshake. Regardless of the setting of this bit, a CONTROL endpoint must receive a SETUP packet and respond with ACK if the packet is received successfully.  Upon receiving a SETUP packet, this bit is automatically cleared to 0.</description>
							<lsb>10</lsb>
							<msb>10</msb>
						</field>
					</fields>
				</register>
